{
  "timestamp": "2025-11-12T07:54:34.994063Z",
  "chart_title_list": [
    "Employment Numbers by Pacific Island Countries",
    "Employment by Sex across Pacific Island Countries",
    "Employment Numbers by Sex Across Economic Sectors",
    "Employment by Sex in Least Populated Economic Sectors",
    "Employment by Economic Sector and Sex in Solomon Islands and Vanuatu",
    "Employment by Sector and Sex in Cook Islands and Niue"
  ],
  "chart_pattern": [
    "The chart reveals a striking disparity in employment numbers across Pacific Island countries, with the Solomon Islands and Vanuatu far surpassing others, showing employment figures close to 100,000 and 65,000 respectively. This suggests these two countries may have larger populations or more robust labor markets compared to their neighbors. In contrast, nations like Tokelau and Niue show exceptionally low employment, which could reflect smaller populations or limited economic opportunities. The wide variation highlights significant economic diversity in the region, potentially influencing regional development and policy focus.",
    "The most striking pattern in this chart is the consistently higher number of employed males compared to females across almost all Pacific Island countries, with Solomon Islands showing the largest gap. This suggests potential gender disparities in employment opportunities or workforce participation in these regions. Interestingly, some smaller countries like Niue and Tokelau have very low employment numbers overall, which might reflect their smaller populations or different economic structures. The differences could also imply cultural, social, or policy factors influencing male and female labor market engagement differently across these island nations.",
    "The most striking pattern is the pronounced gender imbalance in certain sectors, particularly Agriculture and Fishing, where male employment significantly surpasses female employment. Conversely, sectors like Education show a higher number of employed females than males, suggesting traditional gender roles may still influence job distributions. This disparity could reflect both societal norms and differing workforce preferences or opportunities between men and women. Understanding these patterns is important for addressing gender equality in the labor market across various industries.",
    "The most striking pattern in the chart is the extremely low female employment in Construction compared to male workers, which contrasts sharply with Education where females dominate. This suggests strong gender-based occupational segregation in certain low-employment sectors, possibly due to social norms or job requirements. Additionally, Agriculture and Fishing have the highest overall employment with a significant male majority, indicating these physically demanding sectors may continue to be male-dominated. These disparities highlight ongoing gender imbalances in specific industries that might affect workforce diversity and sector growth.",
    "The most striking pattern in the chart is the overwhelmingly higher number of males employed in Agriculture and Fishing compared to females, highlighting a significant gender gap in this sector. Meanwhile, females dominate in Wholesale and Retail, suggesting a gender-based division of labor across sectors. This disparity could reflect cultural or economic factors influencing job roles, where men might engage more in traditional or physically demanding work like fishing, while women may find more opportunities in retail. The relative balance in Education employment hints at a sector with more gender parity, possibly due to differing societal norms or policies. Understanding these patterns is crucial for designing targeted employment policies to promote gender inclusion in various economic sectors.",
    "A striking pattern in the employment distribution is the significant gender disparity within sectors in the Cook Islands, where females dominate sectors like Education, Social Work and Health, and Wholesale and Retail, while males overwhelmingly lead in Construction and Agriculture and Fishing. In contrast, Niue shows much lower employment numbers overall with less pronounced gender gaps, though males slightly outnumber females in sectors like Construction and Wholesale and Retail. This disparity in the Cook Islands could reflect traditional gender roles or sectoral opportunities shaped by cultural and economic factors. The smaller scale and more balanced gender distribution in Niue might suggest a different economic structure or labor market dynamics with fewer specialized roles."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\"\n      ],\n      \"insight\": \"Solomon Islands has the highest TotalEmployed among Pacific Island Countries, significantly surpassing Vanuatu and others.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Niue is 512 when Pacific Island Countries is Niue.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 172 when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tuvalu is 1501 when Pacific Island Countries is Tuvalu.\",\n        \"The TotalEmployed of Pacific Island Countries Nauru is 2314 when Pacific Island Countries is Nauru.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\"\n      ],\n      \"insight\": \"Several smaller Pacific Island Countries such as Niue, Tokelau, Tuvalu, and Nauru have relatively low employment numbers under 2500.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Palau is 6398 when Pacific Island Countries is Palau.\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 10330 when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Micronesia (Federated States of) is 11242 when Pacific Island Countries is Micronesia (Federated States of).\"\n      ],\n      \"insight\": \"Palau, Marshall Islands, and Micronesia (Federated States of) exhibit mid-range employment levels between approximately 6,400 and 11,200.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\"\n      ],\n      \"insight\": \"Samoa, Kiribati, and Tonga have quite similar employment numbers, ranging from around 16,900 to 19,300, indicating comparable workforce sizes.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\"\n      ],\n      \"insight\": \"Both Solomon Islands and Vanuatu stand out as large employment centers, together accounting for a major share of total employment among Pacific Island Countries.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 7811 more than that of Vanuatu when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 36795 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 2.03 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 63655 when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\"\n      ],\n      \"insight\": \"Because Vanuatu and Solomon Islands have the highest increases in TotalEmployed compared to their baseline values, these countries stand out as major contributors to employment within Pacific Island Countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 2.27 times more than that of Marshall Islands when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 7169 when Pacific Island Countries is Marshall Islands.\",\n        \"The Pacific Island Countries Marshall Islands accounts for 69.40% of the TotalEmployed when Pacific Island Countries is Marshall Islands.\"\n      ],\n      \"insight\": \"When comparing employment proportions, Marshall Islands shows a dominant share with nearly 70% of the TotalEmployed within its category, indicating a strong employment concentration there.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 3437 more than that of Kiribati when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 11102 when Pacific Island Countries is Kiribati.\",\n        \"The Pacific Island Countries Kiribati accounts for 59.16% of the TotalEmployed when Pacific Island Countries is Kiribati.\"\n      ],\n      \"insight\": \"Because Kiribati has a substantial increment of 3,437 in TotalEmployed and accounts for over 59% of total employment, it represents a significant labor force among Pacific Island Countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Male is 766.93 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 352.46 times more than that of Female when Sex is Female.\",\n        \"The Sex Male accounts for 40.70% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Female accounts for 32.61% of the TotalEmployed when Sex is Female.\"\n      ],\n      \"insight\": \"We observe that despite males having a higher multiple increase in TotalEmployed compared to females, their share of total employment is only slightly higher, indicating more dispersed employment figures across sexes in Pacific Island Countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 6 more than that of Tokelau when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 89 when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 51.74% of the TotalEmployed when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 48.26% of the TotalEmployed when Pacific Island Countries is Tokelau.\"\n      ],\n      \"insight\": \"Because Tokelau accounts for roughly half of the TotalEmployed with a modest total employment number, it highlights smaller scale but balanced employment distribution by gender in some Pacific Island Countries.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 27460 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 61584 when Sex is Male.\",\n        \"The Sex Male accounts for 39.37% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Female accounts for 28.55% of the TotalEmployed when Sex is Female.\"\n      ],\n      \"insight\": \"Male employment numbers significantly exceed Female employment numbers overall, with males accounting for a larger share of total employment than females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Agriculture and Fishing is 27460 when Economic sector is Agriculture and Fishing.\",\n        \"The TotalEmployed of Economic sector Agriculture and Fishing is 61584 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 69.16% of the TotalEmployed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 30.84% of the TotalEmployed when Economic sector is Agriculture and Fishing.\"\n      ],\n      \"insight\": \"In the Agriculture and Fishing sector, males dominate employment, accounting for about 69% of the total employed, while females account for approximately 31%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Social Work and Health  is 5794 when Economic sector is Social Work and Health .\",\n        \"The TotalEmployed of Economic sector Social Work and Health  is 3727 when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 60.85% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 39.15% of the TotalEmployed when Economic sector is Social Work and Health .\"\n      ],\n      \"insight\": \"The Social Work and Health sector is female-dominated, with females representing around 61% of total employment compared to males at 39%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Construction is 256 when Economic sector is Construction.\",\n        \"The TotalEmployed of Economic sector Construction is 15931 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 1.58% of the TotalEmployed when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 98.42% of the TotalEmployed when Economic sector is Construction.\"\n      ],\n      \"insight\": \"The Construction sector is overwhelmingly male-dominated, with males making up over 98% of total employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Accommodation and Food is 7429 when Economic sector is Accommodation and Food.\",\n        \"The TotalEmployed of Economic sector Accommodation and Food is 6339 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 53.96% of the TotalEmployed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 46.04% of the TotalEmployed when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"Employment in the Accommodation and Food sector is relatively balanced, with a slight female predominance at 54% compared to 46% males.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The SectorRank of Economic sector Agriculture and Fishing is 10 when Economic sector is Agriculture and Fishing.\",\n        \"The SectorRank of Economic sector Construction is 6 when Economic sector is Construction.\",\n        \"The SectorRank of Economic sector Education is 8 when Economic sector is Education.\",\n        \"The SectorRank of Economic sector Support Service is 7 when Economic sector is Support Service.\",\n        \"The SectorRank of Economic sector Wholesale and Retail is 9 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Agriculture and Fishing accounts for 50.00% of the SectorRank when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Construction accounts for 50.00% of the SectorRank when Economic sector is Construction.\",\n        \"The Economic sector Education accounts for 50.00% of the SectorRank when Economic sector is Education.\",\n        \"The Economic sector Support Service accounts for 50.00% of the SectorRank when Economic sector is Support Service.\",\n        \"The Economic sector Wholesale and Retail accounts for 50.00% of the SectorRank when Economic sector is Wholesale and Retail.\",\n        \"The SectorRank of Sex Female is 10 when Sex is Female.\",\n        \"The SectorRank of Sex Male is 10 when Sex is Male.\",\n        \"The SectorRank of Sex Female is 6 when Sex is Female.\",\n        \"The SectorRank of Sex Male is 6 when Sex is Male.\",\n        \"The SectorRank of Sex Female is 8 when Sex is Female.\",\n        \"The SectorRank of Sex Male is 8 when Sex is Male.\",\n        \"The SectorRank of Sex Female is 7 when Sex is Female.\",\n        \"The SectorRank of Sex Male is 7 when Sex is Male.\",\n        \"The SectorRank of Sex Female is 9 when Sex is Female.\",\n        \"The SectorRank of Sex Male is 9 when Sex is Male.\",\n        \"The Sex Female accounts for 25.00% of the SectorRank when Sex is Female.\",\n        \"The Sex Male accounts for 25.00% of the SectorRank when Sex is Male.\",\n        \"The Sex Female accounts for 22.50% of the SectorRank when Sex is Female.\",\n        \"The Sex Male accounts for 22.50% of the SectorRank when Sex is Male.\",\n        \"The Sex Female accounts for 20.00% of the SectorRank when Sex is Female.\",\n        \"The Sex Male accounts for 20.00% of the SectorRank when Sex is Male.\",\n        \"The Sex Female accounts for 17.50% of the SectorRank when Sex is Female.\",\n        \"The Sex Male accounts for 17.50% of the SectorRank when Sex is Male.\",\n        \"The Sex Female accounts for 15.00% of the SectorRank when Sex is Female.\",\n        \"The Sex Male accounts for 15.00% of the SectorRank when Sex is Male.\"\n      ],\n      \"insight\": [\n        \"In the least populated economic sectors, the SectorRank values for females and males are consistently equal across all sectors, showing parity in ranking by sex within these sectors.\",\n        \"Each of the least populated economic sectors—Agriculture and Fishing, Construction, Education, Support Service, and Wholesale and Retail—accounts for exactly 50% of the SectorRank, indicating a balanced distribution within sectors.\",\n        \"The representation by Sex within these sectors varies gradually, with female and male employment shares ranging closely between 15.00% and 25.00%, suggesting similar proportional employment by sex in these low-population sectors.\",\n        \"Because the Sex category consistently holds identical SectorRank scores across the reported sectors (ranging from 6 to 10), there is no discernible dominance of one sex over the other in the least populated economic sectors.\",\n        \"When comparing the SectorRank percentages across sexes, both females and males show a relatively uniform distribution without extreme variation, highlighting an equitable employment presence across genders in these sectors.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Male is 30646 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 14021 when Sex is Female.\",\n        \"The Sex Male accounts for 30.51% of the Number of employed persons when Sex is Male.\",\n        \"The Sex Female accounts for 23.23% of the Number of employed persons when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 212.82 times more than that of Male when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 144.55 times more than that of Female when Sex is Female.\"\n      ],\n      \"insight\": \"Male employment numbers exceed female employment numbers substantially in Solomon Islands and Vanuatu, with males representing around 30.51% and females 23.23% of the employed persons across sectors.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Construction is 4340 when Economic sector is Construction.\",\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 30646 when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Accommodation and Food is 2657 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Agriculture and Fishing accounts for 25.77% of the Number of employed persons when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Construction accounts for 40.92% of the Number of employed persons when Economic sector is Construction.\"\n      ],\n      \"insight\": \"Agriculture and Fishing is the dominant economic sector in employment numbers, accounting for over a quarter of employed persons, with Construction also contributing a significant share.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Transportation and Storage is 4082 when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 41.79% of the Number of employed persons when Economic sector is Transportation and Storage.\",\n        \"The Number of employed persons of Sex Male is 10454 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 7350 when Sex is Female.\"\n      ],\n      \"insight\": \"Transportation and Storage shows a high concentration of employed persons, with over 40% representation and substantial participation from both males and females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Accommodation and Food is 1055 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 38.56% of the Number of employed persons when Economic sector is Accommodation and Food.\",\n        \"The Number of employed persons of Sex Female is 1129 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 328 when Sex is Male.\"\n      ],\n      \"insight\": \"Accommodation and Food employs a considerable proportion of people, with females having higher employed numbers than males within this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Education is 5982 when Economic sector is Education.\",\n        \"The Number of employed persons of Economic sector Education is 7385 when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 32.94% of the Number of employed persons when Economic sector is Education.\",\n        \"The Number of employed persons of Sex Female is 11962 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 19655 when Sex is Male.\"\n      ],\n      \"insight\": \"Education is a significant employment sector in Solomon Islands and Vanuatu, representing nearly a third of employed persons, with male employment consistently higher than female.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Agriculture and Fishing is 198 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 77.04% of the TotalEmployed when Economic sector is Agriculture and Fishing.\",\n        \"The TotalEmployed of Economic sector Construction is 496 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 90.35% of the TotalEmployed when Economic sector is Construction.\",\n        \"The TotalEmployed of Economic sector Wholesale and Retail is 598 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 52.05% of the TotalEmployed when Economic sector is Wholesale and Retail.\",\n        \"The TotalEmployed of Sex Female is 443 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 399 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 66.44 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 45.09 times more than that of Male when Sex is Male.\",\n        \"The Economic sector Accommodation and Food accounts for 49.00% of the TotalEmployed when Economic sector is Accommodation and Food.\",\n        \"The TotalEmployed of Economic sector Accommodation and Food is 443 when Economic sector is Accommodation and Food.\",\n        \"The TotalEmployed of Economic sector Social Work and Health  is 244 when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 73.49% of the TotalEmployed when Economic sector is Social Work and Health .\"\n      ],\n      \"insight\": \"In Pacific Island countries, Agriculture and Fishing and Construction sectors have the highest employment concentration with over 77% and 90% respectively, while Wholesale and Retail shows both the largest total employed and a lower concentration around 52%, highlighting sectoral diversity in employment distribution.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 443 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 399 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 66.44 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 45.09 times more than that of Male when Sex is Male.\",\n        \"The Sex Female accounts for 26.06% of the TotalEmployed when Sex is Female.\",\n        \"The Sex Male accounts for 19.58% of the TotalEmployed when Sex is Male.\"\n      ],\n      \"insight\": \"Female employment in Pacific Island countries surpasses male employment both in scale and relative frequency, with females representing about 26% of total employed compared to 19.58% for males.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Social Work and Health  is 244 when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 73.49% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The TotalEmployed of Economic sector Education is 220 when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 57.74% of the TotalEmployed when Economic sector is Education.\"\n      ],\n      \"insight\": \"Employment in Social Work and Health and Education sectors shows high sectoral concentration with 73.49% and 57.74% of total employed respectively, indicating these are key sectors for Pacific Island countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Accommodation and Food is 443 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 49.00% of the TotalEmployed when Economic sector is Accommodation and Food.\",\n        \"The TotalEmployed of Economic sector Support Service is 300 when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 49.50% of the TotalEmployed when Economic sector is Support Service.\"\n      ],\n      \"insight\": \"Accommodation and Food and Support Service sectors employ nearly half of their workforce within each sector, reflecting a moderate employment concentration pattern in Pacific Island countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Transportation and Storage is 256 when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 76.19% of the TotalEmployed when Economic sector is Transportation and Storage.\",\n        \"The TotalEmployed of Economic sector Electricity and Gas is 43 when Economic sector is Electricity and Gas.\",\n        \"The Economic sector Electricity and Gas accounts for 66.15% of the TotalEmployed when Economic sector is Electricity and Gas.\"\n      ],\n      \"insight\": \"Transportation and Storage and Electricity and Gas sectors show high employment concentration of over 66%, with Transportation and Storage also reflecting higher total employment among Pacific Island countries.\"\n    }\n  ]\n}"
  ]
}