{
  "timestamp": "2025-11-13T09:01:36.064228Z",
  "chart_title_list": [
    "Employment Distribution Across Pacific Island Countries",
    "Employment by Sex Across Pacific Island Countries",
    "Employment Numbers Across Economic Sectors",
    "Male Employment Proportion by Sector and Country",
    "Employment by Sex and Economic Sector in Solomon Islands",
    "Employment by Sex and Economic Sector in Tokelau"
  ],
  "chart_pattern": [
    "The chart reveals that the Solomon Islands account for the largest share of employment among the Pacific Island countries surveyed, comprising over a third of the total. This suggests a relatively larger workforce or employment opportunities compared to its peers. Vanuatu also holds a significant portion, while smaller nations like Kiribati and Samoa have noticeably smaller shares. The sizable \"Others\" category implies diverse, smaller contributions that could reflect numerous islands with limited employment bases, highlighting regional disparities in labor distribution.",
    "The chart reveals a consistent pattern where male employment outnumbers female employment across most Pacific Island countries, with the Solomon Islands showing the most pronounced gap. This could reflect traditional gender roles or economic sectors predominantly employing men in these societies. Interestingly, countries like Vanuatu and Kiribati also display significant employment numbers for both sexes, suggesting more balanced or diverse labor markets. The relatively low employment figures in smaller nations such as Niue and Tuvalu might indicate limited economic opportunities overall. These patterns highlight the interplay between cultural factors and economic development in shaping employment by sex.",
    "The most striking pattern in the chart is the dominance of the Agriculture and Fishing sector, employing over a third of the workforce, which is significantly higher than any other sector. This suggests that the economy may be heavily reliant on primary industries, possibly reflecting a rural or developing region where agriculture remains a major source of employment. Meanwhile, the relatively small share in Support Service could indicate either limited development in service-oriented jobs or a classification issue. The sizable \"Others\" category also hints at a diverse range of smaller sectors that collectively contribute meaningfully but are not individually detailed, which may obscure more nuanced employment trends.",
    "The most striking pattern in the chart is the exceptionally high male employment proportion in the Construction sector compared to others, with several countries contributing significantly to this peak. This suggests that construction is a dominant male employment sector across Pacific Island countries, possibly due to the labor-intensive nature and cultural gender roles associated with this field. In contrast, sectors like Social Work and Health show much lower male employment proportions, indicating these may be less traditional or accessible for men in these regions. This disparity highlights potential gendered segmentation in the workforce, which could impact economic development and social policies.",
    "The most striking pattern is the overwhelming male dominance in the Agriculture and Fishing sector, with males employed in significantly higher numbers than females. This could reflect traditional gender roles or greater male access to agricultural jobs in the Solomon Islands. Conversely, sectors like Education and Social Work and Health show a more balanced or female-leaning employment, suggesting fields where women may have greater representation. The stark contrasts highlight how cultural, social, or economic factors might influence gender participation across different sectors. This disparity could have implications for targeted policies aiming to promote gender equality in the workforce.",
    "The most striking pattern is the significant dominance of female employment in the Education sector, where females outnumber males by a large margin. This contrasts with sectors like Construction and Electricity and Gas, where males have noticeably higher employment. The prominence of females in Education and Social Work and Health might reflect traditional gender roles or targeted policies promoting women in these fields. Meanwhile, male dominance in Construction and Electricity may relate to the physical demands or cultural norms associated with those jobs. This distribution highlights a clear gender specialization across economic sectors in Tokelau."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The EmploymentShare of CountryGroup Kiribati is 0.0743000348398948 when CountryGroup is Kiribati.\",\n        \"The EmploymentShare of CountryGroup Others is 0.21262233553986 when CountryGroup is Others.\",\n        \"The EmploymentShare of CountryGroup Samoa is 0.0764458556361448 when CountryGroup is Samoa.\",\n        \"The EmploymentShare of CountryGroup Solomon Islands is 0.3762075190827605 when CountryGroup is Solomon Islands.\",\n        \"The EmploymentShare of CountryGroup Vanuatu is 0.2604242549013397 when CountryGroup is Vanuatu.\"\n      ],\n      \"insight\": [\n        \"Solomon Islands has the highest employment share (0.376) among the listed Pacific Island Countries.\",\n        \"Vanuatu ranks second with a substantial employment share of approximately 0.26, indicating a significant workforce proportion.\",\n        \"The employment shares of Kiribati and Samoa are similar and relatively low, both around 0.07 to 0.08, showing a smaller distribution of employment.\",\n        \"The category 'Others' holds a moderate employment share of about 0.21, suggesting a diverse group with considerable employment but less than Solomon Islands and Vanuatu.\",\n        \"There is a clear disparity in employment share distribution across Pacific Island Countries, with Solomon Islands and Vanuatu dominating compared to smaller shares in Kiribati and Samoa.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Pacific Island Countries Solomon Islands is 2.03 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The Total_Employed of Pacific Island Countries Samoa is 1.65 times more than that of Samoa when Pacific Island Countries is Samoa.\",\n        \"The Total_Employed of Pacific Island Countries Marshall Islands is 2.27 times more than that of Marshall Islands when Pacific Island Countries is Marshall Islands.\",\n        \"The Total_Employed of Pacific Island Countries Palau is 1.56 times more than that of Palau when Pacific Island Countries is Palau.\",\n        \"The Total_Employed of Pacific Island Countries Tonga is 1.54 times more than that of Tonga when Pacific Island Countries is Tonga.\"\n      ],\n      \"insight\": \"Employment in certain Pacific Island Countries such as Solomon Islands, Marshall Islands, Samoa, Palau, and Tonga shows more than 1.5 times increase compared to their direct counts, indicating significant aggregation or broader reporting in these countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Vanuatu accounts for 44.06% of the Total_Employed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 55.94% of the Total_Employed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Kiribati accounts for 40.84% of the Total_Employed when Pacific Island Countries is Kiribati.\",\n        \"The Pacific Island Countries Kiribati accounts for 59.16% of the Total_Employed when Pacific Island Countries is Kiribati.\",\n        \"The Pacific Island Countries Tokelau accounts for 48.26% of the Total_Employed when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 51.74% of the Total_Employed when Pacific Island Countries is Tokelau.\"\n      ],\n      \"insight\": \"The gender distribution of total employed in Pacific Island Countries like Vanuatu, Kiribati, and Tokelau is nearly balanced, each accounting for roughly 40-60% split of the total employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Sex Female is 352.46 times more than that of Female when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 766.93 times more than that of Male when Sex is Male.\",\n        \"The Total_Employed of Sex Male is 443.31 times more than that of Male when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 325.66 times more than that of Female when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 139.38 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Overall employment figures for Sex Male significantly exceed those for Sex Female by several hundred times, highlighting a dominant male employment representation across Pacific Island Countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Pacific Island Countries Vanuatu is 7811 more than that of Vanuatu when Pacific Island Countries is Vanuatu.\",\n        \"The Total_Employed of Pacific Island Countries Kiribati is 3437 more than that of Kiribati when Pacific Island Countries is Kiribati.\",\n        \"The Total_Employed of Pacific Island Countries Micronesia (Federated States of) is 1954 more than that of Micronesia (Federated States of) when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The Total_Employed of Pacific Island Countries Nauru is 462 more than that of Nauru when Pacific Island Countries is Nauru.\",\n        \"The Total_Employed of Pacific Island Countries Cook Islands is 222 more than that of Cook Islands when Pacific Island Countries is Cook Islands.\"\n      ],\n      \"insight\": \"Some Pacific Island Countries like Vanuatu, Kiribati, and Micronesia contribute notably larger absolute increases in total employment counts compared to their baseline registered employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Samoa accounts for 37.73% of the Total_Employed when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Samoa accounts for 62.27% of the Total_Employed when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 33.01% of the Total_Employed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the Total_Employed when Pacific Island Countries is Solomon Islands.\"\n      ],\n      \"insight\": \"In Pacific Island Countries such as Samoa and Solomon Islands, there is a clear gender employment imbalance where either sex accounts for more than 60% of total employment.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The EmploymentShare of SectorGroup Agriculture and Fishing is 0.3525322269027333 when SectorGroup is Agriculture and Fishing.\",\n        \"The EmploymentShare of SectorGroup Education is 0.1275298514553574 when SectorGroup is Education.\",\n        \"The EmploymentShare of SectorGroup Others is 0.2492121432869857 when SectorGroup is Others.\",\n        \"The EmploymentShare of SectorGroup Support Service is 0.068595002058721 when SectorGroup is Support Service.\",\n        \"The EmploymentShare of SectorGroup Wholesale and Retail is 0.2021307762962024 when SectorGroup is Wholesale and Retail.\"\n      ],\n      \"insight\": [\n        \"Agriculture and Fishing sector accounts for the largest employment share, representing over a third of total employment.\",\n        \"Wholesale and Retail holds a substantial share of the workforce, comprising around 20% of total employment.\",\n        \"The 'Others' sector contributes nearly a quarter of employment, indicating significant economic activity outside main sector groups.\",\n        \"Education sector employs approximately 13% of workers, highlighting its role as a notable but not dominant employment sector.\",\n        \"Support Service sector has the smallest employment share, with less than 7% of total employment.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Economic sector Financial and Insurance accounts for 15.38% of the MaleEmploymentProportion when Economic sector is Financial and Insurance.\",\n        \"The Economic sector Agriculture and Fishing accounts for 9.99% of the MaleEmploymentProportion when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Accommodation and Food accounts for 10.47% of the MaleEmploymentProportion when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Education accounts for 12.15% of the MaleEmploymentProportion when Economic sector is Education.\",\n        \"The Economic sector Social Work and Health  accounts for 11.68% of the MaleEmploymentProportion when Economic sector is Social Work and Health .\"\n      ],\n      \"insight\": \"Financial and Insurance sector has the highest male employment proportion at 15.38%, surpassing other sectors such as Education, Social Work and Health, and Agriculture and Fishing.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Agriculture and Fishing accounts for 9.99% of the MaleEmploymentProportion when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 9.48% of the MaleEmploymentProportion when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 8.82% of the MaleEmploymentProportion when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 8.39% of the MaleEmploymentProportion when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 8.35% of the MaleEmploymentProportion when Economic sector is Agriculture and Fishing.\"\n      ],\n      \"insight\": \"Male employment proportions in the Agriculture and Fishing sector vary but consistently remain between approximately 8.3% and 10%, reflecting moderate but stable male workforce representation.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Support Service accounts for 12.35% of the MaleEmploymentProportion when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 11.03% of the MaleEmploymentProportion when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 9.65% of the MaleEmploymentProportion when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 9.54% of the MaleEmploymentProportion when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 9.20% of the MaleEmploymentProportion when Economic sector is Support Service.\"\n      ],\n      \"insight\": \"Support Service sector maintains a relatively high male employment proportion, mostly around 9% to 12%, indicating its significant role in male employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Accommodation and Food accounts for 10.47% of the MaleEmploymentProportion when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 10.21% of the MaleEmploymentProportion when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 9.95% of the MaleEmploymentProportion when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 9.11% of the MaleEmploymentProportion when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 7.75% of the MaleEmploymentProportion when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"Accommodation and Food sector demonstrates a moderate male employment proportion generally between 7.7% and 10.5%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Transportation and Storage accounts for 9.76% of the MaleEmploymentProportion when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 9.27% of the MaleEmploymentProportion when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 8.91% of the MaleEmploymentProportion when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 8.77% of the MaleEmploymentProportion when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 8.50% of the MaleEmploymentProportion when Economic sector is Transportation and Storage.\"\n      ],\n      \"insight\": \"Transportation and Storage sector holds a steady male employment proportion close to around 8.5% to almost 10%, showing consistent participation of males in this sector.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Female is 14021 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 30646 when Sex is Male.\",\n        \"The Sex Female accounts for 44.70% of the Number of employed persons when Sex is Female.\",\n        \"The Sex Male accounts for 48.14% of the Number of employed persons when Sex is Male.\",\n        \"The Number of employed persons of Sex Male is 93.43 times more than that of Male when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 64.61 times more than that of Female when Sex is Female.\"\n      ],\n      \"insight\": \"In Solomon Islands, the Number of employed males (30,646) considerably exceeds females (14,021), with males accounting for a slightly higher percentage of total employment than females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 14021 when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 30646 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 31.39% of the Number of employed persons when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 68.61% of the Number of employed persons when Economic sector is Agriculture and Fishing.\"\n      ],\n      \"insight\": \"Agriculture and Fishing dominate employment in Solomon Islands with male workers representing over two-thirds (68.61%) of the sector's workforce.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Accommodation and Food is 1055 when Economic sector is Accommodation and Food.\",\n        \"The Number of employed persons of Economic sector Accommodation and Food is 328 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 23.72% of the Number of employed persons when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 76.28% of the Number of employed persons when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"The Accommodation and Food sector has a significant employment share, with females constituting about three-quarters (76.28%) of its workforce in Solomon Islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Transportation and Storage is 217 when Economic sector is Transportation and Storage.\",\n        \"The Number of employed persons of Economic sector Transportation and Storage is 4082 when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 5.05% of the Number of employed persons when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 94.95% of the Number of employed persons when Economic sector is Transportation and Storage.\"\n      ],\n      \"insight\": \"Transportation and Storage sector employment is heavily male-dominated, with males comprising almost 95% of the sector's employees in Solomon Islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 7350 when Economic sector is Wholesale and Retail.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 10454 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 41.28% of the Number of employed persons when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 58.72% of the Number of employed persons when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"Wholesale and Retail sector employment shows a balanced gender distribution, with males constituting about 59% and females about 41% of workers in Solomon Islands.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Male is 28 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 49 when Sex is Female.\",\n        \"The Sex Female accounts for 55.06% of the Number of employed persons when Sex is Female.\",\n        \"The Sex Male accounts for 33.73% of the Number of employed persons when Sex is Male.\",\n        \"The Number of employed persons of Sex Male is 1.75 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"In Tokelau, females have a substantially higher number of employed persons than males, with females accounting for over 55% of employment among females compared to roughly 34% among males.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Education is 49 when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 74.24% of the Number of employed persons when Economic sector is Education.\",\n        \"The Number of employed persons of Economic sector Education is 2.88 times more than that of Education when Economic sector is Education.\",\n        \"The Number of employed persons of Economic sector Education is 17 when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 25.76% of the Number of employed persons when Economic sector is Education.\"\n      ],\n      \"insight\": \"The Education sector in Tokelau dominates employment with 74.24% of employed persons in that sector, showing a clear emphasis on education-related jobs.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 13 when Economic sector is Wholesale and Retail.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 16 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 44.83% of the Number of employed persons when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 55.17% of the Number of employed persons when Economic sector is Wholesale and Retail.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 3 more than that of Wholesale and Retail when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"Wholesale and Retail is a significant economic sector in Tokelau, representing about half of employment within that sector and showing steady employed numbers.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Male is 1.65 times more than that of Male when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 1.81 times more than that of Female when Sex is Female.\",\n        \"The Sex Male accounts for 26.51% of the Number of employed persons when Sex is Male.\",\n        \"The Sex Female accounts for 30.34% of the Number of employed persons when Sex is Female.\",\n        \"The Sex Female accounts for 14.61% of the Number of employed persons when Sex is Female.\"\n      ],\n      \"insight\": \"Female employment consistently leads male employment proportions across sectors in Tokelau with females making up a higher percentage share of employed persons.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Construction is 28 when Economic sector is Construction.\",\n        \"The Number of employed persons of Economic sector Electricity and Gas is 22 when Economic sector is Electricity and Gas.\",\n        \"The Number of employed persons of Economic sector Social Work and Health  is 27 when Economic sector is Social Work and Health .\",\n        \"The Number of employed persons of Sex Male is 17 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 27 when Sex is Female.\"\n      ],\n      \"insight\": \"Employment in Tokelau shows diversity across sectors such as Construction, Electricity and Gas, and Social Work and Health, each holding moderate employment numbers balanced between male and female workers.\"\n    }\n  ]\n}"
  ]
}