{
  "timestamp": "2025-11-13T08:38:18.883240Z",
  "chart_title_list": [
    "Employment Count by Pacific Island Countries",
    "Employment by Sex Across Pacific Island Countries",
    "Employment Numbers by Sex Across Countries",
    "Employment by Sex Across Economic Sectors",
    "Employment in Solomon Islands by Sector and Sex",
    "Employment in Marshall Islands by Sector and Sex"
  ],
  "chart_pattern": [
    "The chart reveals a striking disparity in employment counts across Pacific Island countries, with Solomon Islands showing a remarkably high number of employed persons compared to others. This could reflect its larger population or more diversified economy relative to smaller island nations. Conversely, countries like Niue and Tokelau have very low employment figures, possibly due to smaller populations or limited industrial activity. Such gaps highlight the varying economic scales and labor markets within the region, which might influence regional development policies and resource allocation.",
    "The chart reveals a consistent pattern where male employment surpasses female employment across most Pacific Island countries, with Solomon Islands showing the largest disparity. Interestingly, countries like Cook Islands and Vanuatu display a relatively smaller gap, suggesting more gender-balanced employment figures. This variation could reflect differing economic structures or cultural norms regarding gender roles in the workforce. The sharp contrast in Solomon Islands might indicate industries or sectors predominantly employing men or barriers limiting female participation. Understanding these differences is crucial for targeted policies promoting inclusive employment opportunities.",
    "The most notable pattern in this chart is the consistently higher employment numbers for males compared to females across all Pacific Island countries. The Solomon Islands and Vanuatu stand out with particularly large differences, where male employment significantly exceeds female employment. This gap might reflect traditional gender roles or differences in labor market participation in these countries. Interestingly, smaller countries like Micronesia and the Federated States of show a smaller absolute difference, which could imply different economic structures or better gender balance in employment. Overall, this pattern highlights ongoing gender disparities in employment across the region that could have social and economic implications.",
    "The most striking pattern in this chart is the substantial male dominance in Agriculture and Fishing, where male employment vastly outnumbers female employment. In contrast, sectors such as Education and Wholesale and Retail show higher female employment, highlighting gendered preferences or barriers in occupational choices. The near parity in Social Work and Insurance suggests some sectors may be more balanced or accessible to both sexes. This disparity likely reflects traditional roles, societal norms, and possibly the physical demands associated with certain industries, which could influence recruitment and retention across genders. Understanding these differences is crucial for policy-making aimed at gender equity in employment.",
    "A striking pattern in the employment distribution in Solomon Islands is the overwhelming male dominance in Agriculture and Fishing, where the number of employed men is more than double that of women. In contrast, sectors like Education show a more balanced gender representation, though males still slightly outnumber females. The minimal female presence in traditionally male-dominated fields such as Construction and Transportation suggests persistent gender role divisions in the labor market. This disparity might reflect cultural norms or differing access to opportunities, highlighting areas where efforts to promote gender equality could be particularly impactful.",
    "The most striking pattern in this chart is the dominance of female employment in the Education sector, surpassing males by a significant margin. This suggests that education roles in the Marshall Islands may be more accessible or culturally aligned with women. Conversely, sectors like Construction and Transportation are predominantly male, reflecting traditional gender roles in physically demanding jobs. The balanced employment in sectors such as Wholesale and Retail indicates more gender integration, which may point to evolving workforce norms. Overall, these disparities highlight how cultural and economic factors shape employment by sex across sectors."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 10330 when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Micronesia (Federated States of) is 11242 when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The TotalEmployed of Pacific Island Countries Palau is 6398 when Pacific Island Countries is Palau.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Nauru is 2314 when Pacific Island Countries is Nauru.\",\n        \"The TotalEmployed of Pacific Island Countries Tuvalu is 1501 when Pacific Island Countries is Tuvalu.\",\n        \"The TotalEmployed of Pacific Island Countries Niue is 512 when Pacific Island Countries is Niue.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 172 when Pacific Island Countries is Tokelau.\"\n      ],\n      \"insight\": [\n        \"Solomon Islands has the highest total employment among Pacific Island Countries, followed by Vanuatu, indicating significant labor market size differences across these countries.\",\n        \"Smaller Pacific Island Countries like Niue and Tokelau report very low total employment counts, reflecting their small population and workforce size.\",\n        \"Countries such as Samoa, Tonga, and Kiribati have moderate total employment levels, suggesting a mid-range labor force relative to other Pacific Island Nations.\",\n        \"Micronesia and Marshall Islands have comparable total employment figures, indicating a similarity in workforce scale within that subgroup of Pacific Island Countries.\",\n        \"Employment counts in Pacific Island Countries vary widely, with the range spanning from as low as 172 in Tokelau to as high as 95,024 in Solomon Islands, reflecting diverse economic and demographic conditions.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 3437 more than that of Kiribati when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 7665 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 11102 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 7811 more than that of Vanuatu when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 28984 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 36795 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 2.03 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 31369 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 63655 when Pacific Island Countries is Solomon Islands.\"\n      ],\n      \"insight\": \"Across the Pacific Island Countries, Solomon Islands and Vanuatu show the largest increase in TotalEmployed compared to their baseline figures, indicating these countries have the highest employment growth among the studied islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Solomon Islands accounts for 33.01% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Vanuatu accounts for 44.06% of the TotalEmployed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 55.94% of the TotalEmployed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Kiribati accounts for 40.84% of the TotalEmployed when Pacific Island Countries is Kiribati.\",\n        \"The Pacific Island Countries Kiribati accounts for 59.16% of the TotalEmployed when Pacific Island Countries is Kiribati.\"\n      ],\n      \"insight\": \"We observe a balanced gender employment distribution across Pacific Island Countries like Solomon Islands, Vanuatu, and Kiribati where the split between two groups accounts for roughly one-third to two-thirds of TotalEmployed.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 6 more than that of Tokelau when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 89 when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 83 when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 51.74% of the TotalEmployed when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 48.26% of the TotalEmployed when Pacific Island Countries is Tokelau.\"\n      ],\n      \"insight\": \"Tokelau has very low TotalEmployed numbers with near equal distribution between the compared groups, highlighting a small but balanced workforce.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 2047 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 2269 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 7665 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 11102 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 31369 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 63655 when Sex is Male.\"\n      ],\n      \"insight\": \"When comparing employment by sex across Pacific Island Countries, male TotalEmployed consistently exceeds female TotalEmployed numbers, often by large margins.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 2.27 times more than that of Marshall Islands when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Palau is 1.56 times more than that of Palau when Pacific Island Countries is Palau.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 1.65 times more than that of Samoa when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 1.54 times more than that of Tonga when Pacific Island Countries is Tonga.\",\n        \"The TotalEmployed of Pacific Island Countries Tuvalu is 1.51 times more than that of Tuvalu when Pacific Island Countries is Tuvalu.\"\n      ],\n      \"insight\": \"Several Pacific Island Countries including Marshall Islands, Samoa, Palau, Tonga, and Tuvalu show TotalEmployed figures that are 1.5 times or more greater than their baseline values, indicating moderate to strong employment growth.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The CountryRank of Sex Female is 6 when Sex is Female.\",\n        \"The CountryRank of Sex Male is 6 when Sex is Male.\",\n        \"The CountryRank of Sex Female is 4 when Sex is Female.\",\n        \"The CountryRank of Sex Male is 4 when Sex is Male.\",\n        \"The CountryRank of Sex Female is 5 when Sex is Female.\",\n        \"The CountryRank of Sex Male is 5 when Sex is Male.\"\n      ],\n      \"insight\": \"Employment numbers for both Female and Male sexes consistently rank between positions 4 and 6 across the dataset, indicating a relatively stable employment ranking by Sex.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Sex Female accounts for 28.57% of the CountryRank when Sex is Female.\",\n        \"The Sex Male accounts for 28.57% of the CountryRank when Sex is Male.\",\n        \"The Sex Female accounts for 23.81% of the CountryRank when Sex is Female.\",\n        \"The Sex Male accounts for 23.81% of the CountryRank when Sex is Male.\"\n      ],\n      \"insight\": \"Both Female and Male employment percentages frequently appear around 23.81% to 28.57% of the overall CountryRank, suggesting similar proportional representation in employment numbers by Sex.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Sex Female accounts for 19.05% of the CountryRank when Sex is Female.\",\n        \"The Sex Male accounts for 19.05% of the CountryRank when Sex is Male.\",\n        \"The Sex Female accounts for 14.29% of the CountryRank when Sex is Female.\",\n        \"The Sex Male accounts for 14.29% of the CountryRank when Sex is Male.\"\n      ],\n      \"insight\": \"Employment shares for both Female and Male categories also appear commonly in lower proportions ranging from 14.29% to 19.05%, indicating variability in employment distribution percentages across countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The CountryRank of Sex Female is 6.00 times more than that of Female when Sex is Female.\",\n        \"The CountryRank of Sex Male is 6.00 times more than that of Male when Sex is Male.\",\n        \"The CountryRank of Sex Female is 5.00 times more than that of Female when Sex is Female.\",\n        \"The CountryRank of Sex Male is 5.00 times more than that of Male when Sex is Male.\",\n        \"The CountryRank of Sex Female is 4.00 times more than that of Female when Sex is Female.\",\n        \"The CountryRank of Sex Male is 4.00 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"The CountryRank for both Female and Male occupations shows multipliers of 4 to 6 times compared to baseline references, indicating significant variations in relative employment strength by Sex.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Solomon Islands is 1 when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Vanuatu is 2 when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Samoa is 3 when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Kiribati is 4 when Pacific Island Countries is Kiribati.\",\n        \"The Pacific Island Countries Tonga is 5 when Pacific Island Countries is Tonga.\",\n        \"The Pacific Island Countries Micronesia (Federated States of) is 6 when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The Pacific Island Countries Solomon Islands accounts for 50.00% of the CountryRank when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Vanuatu accounts for 50.00% of the CountryRank when Pacific Island Countries is Vanuatu.\"\n      ],\n      \"insight\": \"Across Pacific Island Countries, employment CountryRanks range from 1 to 6 with Solomon Islands and Vanuatu often representing 50% of their CountryRank, highlighting regional concentration in employment.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 27460 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 61584 when Sex is Male.\",\n        \"The Sex Male accounts for 39.37% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Female accounts for 28.55% of the TotalEmployed when Sex is Female.\",\n        \"The TotalEmployed of Sex Female is 1.55 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 10.50 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Male employment numbers are generally higher than female employment numbers across the dataset, with males accounting for a larger proportion of total employment than females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Agriculture and Fishing is 61584 when Economic sector is Agriculture and Fishing.\",\n        \"The TotalEmployed of Economic sector Agriculture and Fishing is 27460 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 30.84% of the TotalEmployed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 69.16% of the TotalEmployed when Economic sector is Agriculture and Fishing.\",\n        \"The TotalEmployed of Sex Female is 27460 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 61584 when Sex is Male.\"\n      ],\n      \"insight\": \"The Agriculture and Fishing sector is male-dominated, with males constituting about 69% of employment in this sector compared to around 31% for females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Education is 17671 when Economic sector is Education.\",\n        \"The TotalEmployed of Economic sector Education is 14541 when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 54.86% of the TotalEmployed when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 45.14% of the TotalEmployed when Economic sector is Education.\",\n        \"The TotalEmployed of Sex Female is 17671 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 14541 when Sex is Male.\"\n      ],\n      \"insight\": \"The Education sector employs a slightly higher proportion of females than males, with females making up approximately 55% of the employed population in this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Social Work and Health  is 5794 when Economic sector is Social Work and Health .\",\n        \"The TotalEmployed of Economic sector Social Work and Health  is 3727 when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 60.85% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 39.15% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The TotalEmployed of Sex Female is 5794 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 3727 when Sex is Male.\"\n      ],\n      \"insight\": \"The Social Work and Health sector is predominantly female, with females constituting nearly 61% of total employment in this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Construction is 15931 when Economic sector is Construction.\",\n        \"The TotalEmployed of Economic sector Construction is 256 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 1.58% of the TotalEmployed when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 98.42% of the TotalEmployed when Economic sector is Construction.\",\n        \"The TotalEmployed of Sex Male is 15931 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 256 when Sex is Female.\"\n      ],\n      \"insight\": \"The Construction sector is heavily male-dominated, with males representing over 98% of total employment in this industry.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Agriculture and Fishing is 14021 when Economic sector is Agriculture and Fishing.\",\n        \"The TotalEmployed of Economic sector Agriculture and Fishing is 30646 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 31.39% of the TotalEmployed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 68.61% of the TotalEmployed when Economic sector is Agriculture and Fishing.\",\n        \"The TotalEmployed of Economic sector Wholesale and Retail is 7350 when Economic sector is Wholesale and Retail.\",\n        \"The TotalEmployed of Economic sector Wholesale and Retail is 10454 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 41.28% of the TotalEmployed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 58.72% of the TotalEmployed when Economic sector is Wholesale and Retail.\",\n        \"The TotalEmployed of Economic sector Accommodation and Food is 1055 when Economic sector is Accommodation and Food.\",\n        \"The TotalEmployed of Economic sector Accommodation and Food is 328 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 23.72% of the TotalEmployed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 76.28% of the TotalEmployed when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"Employment in the Solomon Islands is heavily concentrated in Agriculture and Fishing, Wholesale and Retail, and Accommodation and Food sectors, with these three sectors accounting for the majority of total employment and showing significant variations in TotalEmployed values.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 14021 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 30646 when Sex is Male.\",\n        \"The Sex Female accounts for 44.70% of the TotalEmployed when Sex is Female.\",\n        \"The Sex Male accounts for 48.14% of the TotalEmployed when Sex is Male.\"\n      ],\n      \"insight\": \"Male workers outnumber females in total employment in Solomon Islands, with males accounting for a slightly higher share of total employed individuals compared to females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Construction is 97 when Economic sector is Construction.\",\n        \"The TotalEmployed of Economic sector Construction is 4340 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 2.19% of the TotalEmployed when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 97.81% of the TotalEmployed when Economic sector is Construction.\"\n      ],\n      \"insight\": \"The Construction sector shows a highly unequal distribution in employment within the Solomon Islands, with one portion accounting for almost 98% of total employed in this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Social Work and Health  is 1068 when Economic sector is Social Work and Health .\",\n        \"The TotalEmployed of Economic sector Social Work and Health  is 1000 when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 51.64% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 48.36% of the TotalEmployed when Economic sector is Social Work and Health .\"\n      ],\n      \"insight\": \"Employment in the Social Work and Health sector is nearly evenly split between two groups, each accounting for roughly half of the total employed within this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 1055 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 328 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 5982 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 7385 when Sex is Male.\"\n      ],\n      \"insight\": \"Employment numbers vary widely between males and females across different sectors, with males having dominance in some sectors like Education, while females lead in others like Accommodation and Food.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Male is 1137 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 909 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 1106 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 775 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 903 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 441 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 760 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 383 when Sex is Female.\"\n      ],\n      \"insight\": \"In the Marshall Islands, males tend to have higher employment numbers than females across most economic sectors, as exemplified by sectors like Construction and Education.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Education accounts for 54.89% of the Number of employed persons when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 45.11% of the Number of employed persons when Economic sector is Education.\",\n        \"The Economic sector Financial and Insurance accounts for 53.82% of the Number of employed persons when Economic sector is Financial and Insurance.\",\n        \"The Economic sector Financial and Insurance accounts for 46.18% of the Number of employed persons when Economic sector is Financial and Insurance.\",\n        \"The Economic sector Social Work and Health  accounts for 52.81% of the Number of employed persons when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 47.19% of the Number of employed persons when Economic sector is Social Work and Health .\"\n      ],\n      \"insight\": \"Employment distribution within sectors such as Education, Financial and Insurance, and Social Work and Health reveals an almost even split between different groups, indicating balanced participation by sex within these sectors.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Transportation and Storage is 6.74 times more than that of Transportation and Storage when Economic sector is Transportation and Storage.\",\n        \"The Number of employed persons of Economic sector Support Service is 1.94 times more than that of Support Service when Economic sector is Support Service.\",\n        \"The Number of employed persons of Economic sector Accommodation and Food is 44 more than that of Accommodation and Food when Economic sector is Accommodation and Food.\",\n        \"The Number of employed persons of Economic sector Education is 197 more than that of Education when Economic sector is Education.\"\n      ],\n      \"insight\": \"Sectors such as Transportation and Storage and Support Service show notably higher employment multiples, indicating these sectors employ substantially more persons compared to others like Accommodation and Food or Education.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Sex Female accounts for 28.76% of the Number of employed persons when Sex is Female.\",\n        \"The Sex Female accounts for 24.52% of the Number of employed persons when Sex is Female.\",\n        \"The Sex Female accounts for 13.95% of the Number of employed persons when Sex is Female.\",\n        \"The Sex Male accounts for 15.86% of the Number of employed persons when Sex is Male.\",\n        \"The Sex Male accounts for 15.43% of the Number of employed persons when Sex is Male.\",\n        \"The Sex Male accounts for 5.50% of the Number of employed persons when Sex is Male.\"\n      ],\n      \"insight\": \"The proportion of employed persons by sex varies substantially across categories, with females representing higher shares in some employment subsets compared to males, highlighting sectoral or occupational gender concentration.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Female is 2.32 times more than that of Female when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 2.97 times more than that of Male when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 1.76 times more than that of Female when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 1.89 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Employment growth or difference multiples between certain sex categories indicate consistent higher increases for males compared to females across comparative groupings in the dataset.\"\n    }\n  ]\n}"
  ]
}