{
  "timestamp": "2025-11-13T03:20:34.549186Z",
  "chart_title_list": [
    "Employment Numbers Across Pacific Island Countries",
    "Employment by Sex Across Pacific Island Countries",
    "Employment Numbers by Sex Across Pacific Islands",
    "Employment by Sex Across Economic Sectors",
    "Employment by Sector and Sex in Niue",
    "Employment by Sector and Sex in Vanuatu"
  ],
  "chart_pattern": [
    "The Solomon Islands stands out with a remarkably higher number of employed persons compared to other Pacific Island countries, nearly doubling that of the next highest, Vanuatu. This disparity likely reflects differences in population size, economic scale, or labor market structures among these islands. Interestingly, many of the smaller island nations report employment numbers below 20,000, highlighting significant variation in workforce capacity across the region. Such a wide gap may affect regional economic development strategies and resource allocation.",
    "A striking pattern in this chart is the consistently higher number of employed males compared to females across nearly all Pacific Island countries, with the Solomon Islands and Vanuatu showing particularly large employment gaps. This difference may reflect prevailing gender roles or labor market structures that favor male employment in these regions. Interestingly, in smaller island nations like Niue and Tokelau, the number of employed persons is very low overall, and the gender gap appears minimal, which could suggest limited labor market size or different economic activities. These disparities highlight potential areas for targeted policy to support female employment and reduce gender inequality in workforce participation.",
    "The chart reveals a marked disparity in employment numbers between males and females across the Pacific Island countries, with males having significantly higher total employment. This difference could reflect underlying social, economic, or cultural factors that influence workforce participation, such as gender norms or access to certain types of jobs. It may also highlight potential areas for policy intervention to promote more balanced labor market inclusion. Understanding these discrepancies is crucial for developing targeted strategies to improve employment equity in the region.",
    "The most striking pattern in the chart is the strong gender imbalance in certain sectors, particularly Agriculture and Fishing, where male employment vastly exceeds female employment. Conversely, sectors like Education and Wholesale and Retail show a more balanced or even female-dominant workforce. This disparity may reflect traditional gender roles or differences in physical job demands, which can influence the types of jobs men and women pursue or have access to. Understanding these patterns is important for addressing workforce equality and tailoring policies to encourage more gender diversity across all sectors.",
    "The most striking pattern in this chart is the notable gender disparity across several sectors. Females dominate the Support Service and Education sectors by a large margin, which could reflect traditional roles or stronger female presence in education and care-related jobs in Niue. Conversely, males overwhelmingly outnumber females in Construction and Agriculture and Fishing, likely due to these sectors' physically demanding nature or historical gender roles. This split suggests a clear gender-based occupational segregation that might impact economic opportunities and social dynamics on the island. Understanding these trends could help target policies promoting gender balance in employment.",
    "The most striking pattern in the chart is the large gender disparity in the Agriculture and Fishing sector, where male employment far exceeds female employment. This suggests traditional or cultural roles may influence job distribution in this sector. Conversely, in Wholesale and Retail, females dominate employment, which could reflect gender preferences or opportunities in trade and sales roles. Sectors like Education and Support Service show relatively balanced numbers, indicating areas where gender employment is more equitable. This distribution highlights how economic opportunities in Vanuatu are strongly gendered across different sectors."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 10330 when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Micronesia (Federated States of) is 11242 when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The TotalEmployed of Pacific Island Countries Nauru is 2314 when Pacific Island Countries is Nauru.\",\n        \"The TotalEmployed of Pacific Island Countries Niue is 512 when Pacific Island Countries is Niue.\",\n        \"The TotalEmployed of Pacific Island Countries Palau is 6398 when Pacific Island Countries is Palau.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 172 when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\",\n        \"The TotalEmployed of Pacific Island Countries Tuvalu is 1501 when Pacific Island Countries is Tuvalu.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\"\n      ],\n      \"insight\": [\n        \"The Solomon Islands has the highest total employment among Pacific Island Countries with 95,024 employed individuals.\",\n        \"Vanuatu ranks second in total employment in Pacific Island Countries, with 65,779 employed, significantly higher than most other countries.\",\n        \"Countries like Niue and Tokelau have the smallest total employment figures among Pacific Island Countries, with 512 and 172 respectively.\",\n        \"Medium-sized employment numbers are observed in Samoa, Kiribati, and Tonga, each having between 16,920 and 19,309 employed people.\",\n        \"Smaller island nations such as Nauru and Tuvalu report low total employment, with 2,314 and 1,501 employed respectively, indicating large variation across Pacific Island Countries.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 2.03 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 7811 more than that of Vanuatu when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 3437 more than that of Kiribati when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 1.65 times more than that of Samoa when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 2.27 times more than that of Marshall Islands when Pacific Island Countries is Marshall Islands.\"\n      ],\n      \"insight\": \"Pacific Island countries such as Solomon Islands, Marshall Islands, Samoa, Kiribati, and Vanuatu show significantly higher TotalEmployed figures compared to their own baseline values, with some more than doubling or increasing by thousands, highlighting substantial employment in these nations.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Tokelau accounts for 51.74% of the TotalEmployed when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Niue accounts for 48.44% of the TotalEmployed when Pacific Island Countries is Niue.\",\n        \"The Pacific Island Countries Cook Islands accounts for 47.43% of the TotalEmployed when Pacific Island Countries is Cook Islands.\",\n        \"The Pacific Island Countries Vanuatu accounts for 44.06% of the TotalEmployed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Micronesia (Federated States of) accounts for 41.31% of the TotalEmployed when Pacific Island Countries is Micronesia (Federated States of).\"\n      ],\n      \"insight\": \"In Pacific Island countries, the TotalEmployed population is roughly balanced near a 50% share across sub-groups in Cook Islands, Niue, Tokelau, Vanuatu, and Micronesia (Federated States of), indicating relatively even employment distribution within these countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 2047 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 2269 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 3161 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 7169 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 31369 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 63655 when Sex is Male.\"\n      ],\n      \"insight\": \"When analyzing employment by sex across Pacific Island countries, males consistently have higher TotalEmployed numbers than females, with the largest employment gaps observed in countries like Solomon Islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Solomon Islands accounts for 33.01% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Samoa accounts for 37.73% of the TotalEmployed when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Samoa accounts for 62.27% of the TotalEmployed when Pacific Island Countries is Samoa.\"\n      ],\n      \"insight\": \"In countries such as Solomon Islands and Samoa, a clear majority segment accounts for roughly two-thirds of TotalEmployed, indicating concentrated employment within specific groups.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 222 more than that of Cook Islands when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Nauru is 462 more than that of Nauru when Pacific Island Countries is Nauru.\",\n        \"The TotalEmployed of Pacific Island Countries Niue is 16 more than that of Niue when Pacific Island Countries is Niue.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 6 more than that of Tokelau when Pacific Island Countries is Tokelau.\"\n      ],\n      \"insight\": \"Smaller Pacific Island countries such as Cook Islands, Nauru, Niue, and Tokelau report modest increases in TotalEmployed compared to their baseline values, reflecting relatively stable but small workforce sizes.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 96180 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 156404 when Sex is Male.\"\n      ],\n      \"insight\": [\n        \"Across the Pacific Islands, the total number of employed males (156,404) significantly exceeds that of females (96,180), indicating a gender disparity in employment numbers.\",\n        \"Because males have a higher TotalEmployed count than females, males likely represent a larger share of the workforce in Pacific Island countries.\",\n        \"When comparing employment by sex, males dominate in terms of total employment, which could suggest gender differences in occupation types or labor market participation.\",\n        \"We observe that employment numbers vary notably by sex, highlighting the importance of considering sex-based factors in labor market analyses across Pacific Islands.\",\n        \"The chart titled 'Employment Numbers by Sex Across Pacific Islands' underscores that male employment substantially surpasses female employment in this region.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 27460 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 61584 when Sex is Male.\",\n        \"The Sex Male accounts for 39.37% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Female accounts for 28.55% of the TotalEmployed when Sex is Female.\",\n        \"The TotalEmployed of Sex Female is 7429 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 6339 when Sex is Male.\"\n      ],\n      \"insight\": [\n        \"Male employees dominate the total employment numbers across economic sectors, with a notably higher total employed count than females.\",\n        \"In the Agriculture and Fishing sector, males have over twice the employment of females, highlighting gender disparity in this sector.\",\n        \"Certain economic sectors like Education and Social Work and Health have higher female employment proportions, with females accounting for over 50% of total employment in these sectors.\",\n        \"Sectors such as Construction and Electricity and Gas show a very high dominance of male employment, with males representing over 90% of total employed in these sectors.\",\n        \"Although females have lower total employed numbers overall, they represent the majority in social-related sectors, constituting over 60% in Social Work and Health.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Accommodation and Food is 12 more than that of Accommodation and Food when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 59.68% of the TotalEmployed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Education accounts for 71.21% of the TotalEmployed when Economic sector is Education.\",\n        \"The Economic sector Social Work and Health  accounts for 75.56% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The TotalEmployed of Sex Female is 7.22 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 4.82 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Economic sector Agriculture and Fishing is 2.47 times more than that of Agriculture and Fishing when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 71.19% of the TotalEmployed when Economic sector is Agriculture and Fishing.\",\n        \"The TotalEmployed of Economic sector Support Service is 2.71 times more than that of Support Service when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 73.03% of the TotalEmployed when Economic sector is Support Service.\",\n        \"The Economic sector Transportation and Storage accounts for 69.70% of the TotalEmployed when Economic sector is Transportation and Storage.\"\n      ],\n      \"insight\": \"The Accommodation and Food sector is the dominant employer among economic sectors, accounting for nearly 60% of total employment, while sectors like Education, Agriculture and Fishing, Social Work and Health, Support Service, and Transportation and Storage also represent high employment shares often above 70%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 7.22 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 4.82 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 6.50 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Female is 3.82 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 2.79 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Male is 4.09 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Male is 3.82 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Female employment levels are consistently higher than male employment levels across sectors, with female total employed figures often exceeding males by factors ranging from approximately 3.8 to over 7 times.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Social Work and Health  is 3.09 times more than that of Social Work and Health  when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 75.56% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The TotalEmployed of Sex Female is 37 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 25 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 47 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 19 when Sex is Male.\"\n      ],\n      \"insight\": \"Social Work and Health is a key economic sector with high female participation, as evidenced by its large proportion of total employment and higher female employment counts compared to males.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Wholesale and Retail accounts for 39.19% of the TotalEmployed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 60.81% of the TotalEmployed when Economic sector is Wholesale and Retail.\",\n        \"The TotalEmployed of Economic sector Wholesale and Retail is 1.55 times more than that of Wholesale and Retail when Economic sector is Wholesale and Retail.\",\n        \"The TotalEmployed of Economic sector Accommodation and Food is 37 when Economic sector is Accommodation and Food.\",\n        \"The TotalEmployed of Economic sector Accommodation and Food is 25 when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"Employment within the Wholesale and Retail sector shows substantial variation in proportional representation, ranging from about 39% to over 60%, suggesting heterogeneity in employment patterns within this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Transportation and Storage accounts for 30.30% of the TotalEmployed when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 69.70% of the TotalEmployed when Economic sector is Transportation and Storage.\",\n        \"The TotalEmployed of Economic sector Transportation and Storage is 2.30 times more than that of Transportation and Storage when Economic sector is Transportation and Storage.\",\n        \"The TotalEmployed of Sex Female is 29 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 45 when Sex is Male.\"\n      ],\n      \"insight\": \"Transportation and Storage sector employment is split unevenly with higher shares of total employed in some cases nearing 70%, and males tend to have higher employment in this sector compared to females.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Female is 11962 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 19655 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 7898 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 3281 when Sex is Male.\",\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 11962 when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 19655 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 37.83% of the Number of employed persons when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 62.17% of the Number of employed persons when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Construction is 133 when Economic sector is Construction.\",\n        \"The Number of employed persons of Economic sector Construction is 3165 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 4.03% of the Number of employed persons when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 95.97% of the Number of employed persons when Economic sector is Construction.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 7898 when Economic sector is Wholesale and Retail.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 3281 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 70.65% of the Number of employed persons when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 29.35% of the Number of employed persons when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"In Vanuatu, male employment dominates high-percentage economic sectors like Agriculture and Fishing and Construction, while female employment is notably strong in Wholesale and Retail suggesting gender-based sectoral employment distribution.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Education accounts for 64.07% of the Number of employed persons when Economic sector is Education.\",\n        \"The Economic sector Financial and Insurance accounts for 54.89% of the Number of employed persons when Economic sector is Financial and Insurance.\",\n        \"The Economic sector Social Work and Health  accounts for 56.56% of the Number of employed persons when Economic sector is Social Work and Health .\",\n        \"The Economic sector Support Service accounts for 50.37% of the Number of employed persons when Economic sector is Support Service.\",\n        \"The Number of employed persons of Economic sector Education is 3071 when Economic sector is Education.\",\n        \"The Number of employed persons of Economic sector Education is 1722 when Economic sector is Education.\",\n        \"The Number of employed persons of Economic sector Financial and Insurance is 600 when Economic sector is Financial and Insurance.\",\n        \"The Number of employed persons of Economic sector Financial and Insurance is 493 when Economic sector is Financial and Insurance.\",\n        \"The Number of employed persons of Economic sector Social Work and Health  is 660 when Economic sector is Social Work and Health .\",\n        \"The Number of employed persons of Economic sector Social Work and Health  is 507 when Economic sector is Social Work and Health .\",\n        \"The Number of employed persons of Economic sector Support Service is 1687 when Economic sector is Support Service.\",\n        \"The Number of employed persons of Economic sector Support Service is 1662 when Economic sector is Support Service.\"\n      ],\n      \"insight\": \"High percentages of employed persons in sectors such as Education, Financial and Insurance, Social Work and Health, and Support Service reflect balanced gender participation, with both sexes contributing significantly across these sectors in Vanuatu.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Male is 3.45 times more than that of Male when Sex is Male.\",\n        \"The Number of employed persons of Sex Male is 3.35 times more than that of Male when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 4.96 times more than that of Female when Sex is Female.\",\n        \"The Number of employed persons of Sex Female is 4.50 times more than that of Female when Sex is Female.\",\n        \"The Number of employed persons of Sex Female is 414 more than that of Female when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 463 more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Employment numbers for both sexes show considerable variability, but females in Vanuatu often exceed males in certain sectors by a margin greater than 4 times, indicating female-focused employment clusters.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Transportation and Storage accounts for 8.71% of the Number of employed persons when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 91.29% of the Number of employed persons when Economic sector is Transportation and Storage.\",\n        \"The Number of employed persons of Economic sector Transportation and Storage is 316 when Economic sector is Transportation and Storage.\",\n        \"The Number of employed persons of Economic sector Transportation and Storage is 3313 when Economic sector is Transportation and Storage.\"\n      ],\n      \"insight\": \"Transportation and Storage sector in Vanuatu shows a highly skewed employment distribution, where the majority (over 90%) of employed persons belong to a single group indicating a potentially male-dominated or specialized workforce.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Accommodation and Food accounts for 48.25% of the Number of employed persons when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 51.75% of the Number of employed persons when Economic sector is Accommodation and Food.\",\n        \"The Number of employed persons of Economic sector Accommodation and Food is 2657 when Economic sector is Accommodation and Food.\",\n        \"The Number of employed persons of Economic sector Accommodation and Food is 2850 when Economic sector is Accommodation and Food.\",\n        \"The Number of employed persons of Sex Female is 2657 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 2850 when Sex is Male.\"\n      ],\n      \"insight\": \"Employment in the Accommodation and Food sector in Vanuatu is nearly evenly split between males and females, reflecting gender parity in this service-driven economic sector.\"\n    }\n  ]\n}"
  ]
}