{
  "timestamp": "2025-11-13T06:56:36.134875Z",
  "chart_title_list": [
    "Employment Numbers Across Pacific Island Countries",
    "Employment by Sex Across Pacific Island Countries",
    "Employment by Sex Across Economic Sectors",
    "Employment by Sex in Key Pacific Countries",
    "Employment by Sex and Sector in Solomon Islands",
    "Employment by Sex and Sector in Vanuatu"
  ],
  "chart_pattern": [
    "The most striking feature of this chart is the dominant share of employment held by the Solomon Islands, comprising over a third of the total employment across the Pacific Island countries shown. This could reflect its relatively larger population or more diversified economy compared to smaller island nations. Meanwhile, Kiribati and Samoa hold noticeably smaller portions, which might indicate limited labor market opportunities or smaller populations. The \"Others\" category also represents a significant chunk, suggesting that several smaller islands collectively contribute a substantial portion of regional employment. This distribution highlights varying economic scales and labor capacities within the Pacific Islands.",
    "The chart reveals a consistent pattern where male employment numbers surpass those of females across nearly all Pacific Island countries, with Solomon Islands displaying the most pronounced gap. This disparity might reflect traditional gender roles and labor market structures that favor male participation in formal employment. Interestingly, a few smaller countries like Niue and Tokelau show very low employment numbers overall, which could indicate limited economic opportunities or smaller population sizes. The persistent gender gap highlights ongoing challenges in achieving gender parity in employment within this region.",
    "The most striking pattern in this chart is the gender disparity in sectors like Agriculture and Fishing, and Construction, where male employment far exceeds female employment. Conversely, sectors like Education and Accommodation and Food see notably higher female employment. This contrast likely reflects traditional gender roles and occupational preferences, with males dominating physically intensive jobs and females more represented in service and education sectors. It also suggests potential barriers or cultural factors influencing job choice and accessibility for each sex within various industries. Understanding these patterns could help target policies aimed at reducing gender imbalances across sectors.",
    "The chart reveals a significant gender employment gap in the Solomon Islands, where male employment is more than double that of females, highlighting a pronounced disparity. In contrast, Vanuatu shows a narrower gap between male and female employment, suggesting relatively better gender balance in the workforce. Nauru has the smallest employment numbers overall, with the gender gap being minimal but the absolute figures very low. This variation might reflect differing social, economic, or cultural factors influencing workforce participation across these Pacific countries.",
    "The most striking pattern is the overwhelming dominance of males in the Agriculture and Fishing sector compared to females, who have comparatively low employment there. Conversely, females outnumber males significantly in Accommodation and Food, an unusual reversal of the overall male dominance in most sectors. This could reflect traditional gender roles or access barriers in specific industries. The large gender gap in Agriculture and Fishing may indicate a male-preferred or physically demanding sector, while the female concentration in Accommodation and Food might suggest greater opportunities or societal norms directing women into service-oriented jobs.",
    "The most striking pattern is the gender disparity in the Agriculture and Fishing sector, where males significantly outnumber females, suggesting traditionally male-dominated roles or cultural factors influencing employment choices. Conversely, the Wholesale and Retail sector shows a strong female majority, indicating this sector may offer more opportunities or appeal to women in Vanuatu. Education also highlights a female dominance, which might reflect gender preferences or societal roles in teaching professions. These differences point to distinct gender roles within economic sectors, potentially influenced by cultural norms, skill requirements, or access to opportunities. This pattern underscores the importance of targeted policies to address sector-specific gender imbalances."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Share of CountryTop5 Kiribati is 0.0743000348398948 when CountryTop5 is Kiribati.\",\n        \"The Share of CountryTop5 Others is 0.21262233553986 when CountryTop5 is Others.\",\n        \"The Share of CountryTop5 Samoa is 0.0764458556361448 when CountryTop5 is Samoa.\",\n        \"The Share of CountryTop5 Solomon Islands is 0.3762075190827605 when CountryTop5 is Solomon Islands.\",\n        \"The Share of CountryTop5 Vanuatu is 0.2604242549013397 when CountryTop5 is Vanuatu.\"\n      ],\n      \"insight\": [\n        \"Solomon Islands accounts for the largest share of employment among the top five Pacific Island countries, with a share of approximately 37.6%.\",\n        \"Vanuatu follows Solomon Islands with the second highest employment share at around 26.0%, indicating a significant workforce presence.\",\n        \"Other Pacific Island countries collectively represent a substantial share of employment, about 21.3%, which is higher than Kiribati and Samoa individually.\",\n        \"Kiribati and Samoa show relatively similar employment shares, around 7.4% and 7.6% respectively, highlighting smaller yet comparable workforce sizes.\",\n        \"The distribution of employment shares across these Pacific Island countries suggests a concentration of employment in Solomon Islands and Vanuatu, with moderate participation from other countries.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 2.03 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 63655 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 1.65 times more than that of Samoa when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 12024 when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Samoa accounts for 62.27% of the TotalEmployed when Pacific Island Countries is Samoa.\"\n      ],\n      \"insight\": \"The Solomon Islands and Samoa have the highest TotalEmployed counts among Pacific Island Countries, each exceeding double or more their baseline employment and accounting for over 60% of their respective country's total employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 2.27 times more than that of Marshall Islands when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 7169 when Pacific Island Countries is Marshall Islands.\",\n        \"The Pacific Island Countries Marshall Islands accounts for 69.40% of the TotalEmployed when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Sex Male is 12024 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 7285 when Sex is Female.\"\n      ],\n      \"insight\": \"Marshall Islands has a notably high TotalEmployed count that is over double its baseline and accounts for nearly 70% of the employment, consistent with the general trend of male employment dominance in overall counts.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Male is 63655 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 31369 when Sex is Female.\",\n        \"The Sex Male accounts for 40.70% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Female accounts for 32.61% of the TotalEmployed when Sex is Female.\"\n      ],\n      \"insight\": \"Male employment is consistently higher than female employment across Pacific Island Countries, with males representing about 41% of the total employed and females about 33%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 7811 more than that of Vanuatu when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 36795 when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 55.94% of the TotalEmployed when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 222 more than that of Cook Islands when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 2269 when Pacific Island Countries is Cook Islands.\",\n        \"The Pacific Island Countries Cook Islands accounts for 52.57% of the TotalEmployed when Pacific Island Countries is Cook Islands.\"\n      ],\n      \"insight\": \"Vanuatu and Cook Islands both show increased TotalEmployed counts over their baseline with employment shares around or above 50%, signaling balanced gender employment distribution in these countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 6 more than that of Tokelau when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 89 when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 51.74% of the TotalEmployed when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Sex Female is 352.46 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 766.93 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Tokelau, the smallest of the Pacific Island Countries in employment terms, has nearly equal gender employment shares with females representing about 52% of total employed in the country.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 27460 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 61584 when Sex is Male.\",\n        \"The Sex Female accounts for 28.55% of the TotalEmployed when Sex is Female.\",\n        \"The Sex Male accounts for 39.37% of the TotalEmployed when Sex is Male.\"\n      ],\n      \"insight\": \"Male employment substantially exceeds female employment in absolute numbers across the dataset, with males accounting for a larger percentage of total employed compared to females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Education accounts for 54.86% of the TotalEmployed when Economic sector is Education.\",\n        \"The Economic sector Accommodation and Food accounts for 53.96% of the TotalEmployed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Social Work and Health  accounts for 60.85% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Financial and Insurance accounts for 51.48% of the TotalEmployed when Economic sector is Financial and Insurance.\"\n      ],\n      \"insight\": \"Female workers dominate key sectors such as Education, Accommodation and Food, Social Work and Health, and Financial and Insurance, each having over 50% share of total employment in those sectors.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Construction is 15931 when Economic sector is Construction.\",\n        \"The TotalEmployed of Sex Male is 15931 when Sex is Male.\",\n        \"The Economic sector Construction accounts for 98.42% of the TotalEmployed when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 1.58% of the TotalEmployed when Economic sector is Construction.\"\n      ],\n      \"insight\": \"The Construction sector is overwhelmingly male-dominated, with males making up over 98% of total employment in this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Social Work and Health  is 5794 when Economic sector is Social Work and Health .\",\n        \"The TotalEmployed of Sex Female is 5794 when Sex is Female.\",\n        \"The Economic sector Social Work and Health  accounts for 60.85% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 39.15% of the TotalEmployed when Economic sector is Social Work and Health .\"\n      ],\n      \"insight\": \"Social Work and Health is a female-dominated sector contributing 60.85% of the employment in this economic sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Agriculture and Fishing is 61584 when Economic sector is Agriculture and Fishing.\",\n        \"The TotalEmployed of Sex Male is 61584 when Sex is Male.\",\n        \"The Economic sector Agriculture and Fishing accounts for 69.16% of the TotalEmployed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 30.84% of the TotalEmployed when Economic sector is Agriculture and Fishing.\"\n      ],\n      \"insight\": \"Agriculture and Fishing is predominantly male-employed, with males constituting approximately 69% of total employment in this sector.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Male is 63655 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 31369 when Sex is Female.\",\n        \"The Sex Female accounts for 47.30% of the TotalEmployed when Sex is Female.\",\n        \"The Sex Male accounts for 36.13% of the TotalEmployed when Sex is Male.\"\n      ],\n      \"insight\": \"Across key Pacific countries, total employment of males is approximately double that of females, with males constituting around 36% and females around 47% of their respective employment totals, indicating a higher absolute employment count for males despite higher proportional representation for females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 63655 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 31369 when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 33.01% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\"\n      ],\n      \"insight\": \"In Solomon Islands, male employees represent about 67% of total employment while females represent about 33%, showing a significant gender imbalance favoring males within that country.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 36795 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 28984 when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 44.06% of the TotalEmployed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 55.94% of the TotalEmployed when Pacific Island Countries is Vanuatu.\"\n      ],\n      \"insight\": \"In Vanuatu, the employed population is split with approximately 56% being male and 44% female, demonstrating a more balanced gender distribution compared to Solomon Islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Nauru is 1388 when Pacific Island Countries is Nauru.\",\n        \"The TotalEmployed of Pacific Island Countries Nauru is 926 when Pacific Island Countries is Nauru.\",\n        \"The Pacific Island Countries Nauru accounts for 40.02% of the TotalEmployed when Pacific Island Countries is Nauru.\",\n        \"The Pacific Island Countries Nauru accounts for 59.98% of the TotalEmployed when Pacific Island Countries is Nauru.\"\n      ],\n      \"insight\": \"In Nauru, males account for approximately 60% of total employment, while females make up roughly 40%, showing a moderate male dominance in employment ratios.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 2385 more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 1.73 times more than that of Male when Sex is Male.\",\n        \"The Sex Male accounts for 62.51% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Female accounts for 51.19% of the TotalEmployed when Sex is Female.\"\n      ],\n      \"insight\": \"When comparing employment in the dataset overall, males show a higher total employed count and greater proportional representation (over 62%) relative to females whose representation is closer to 51%, indicating gender disparities in employment intensity.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Accommodation and Food is 1055 when Economic sector is Accommodation and Food.\",\n        \"The TotalEmployed of Economic sector Agriculture and Fishing is 30646 when Economic sector is Agriculture and Fishing.\",\n        \"The TotalEmployed of Economic sector Construction is 4340 when Economic sector is Construction.\",\n        \"The TotalEmployed of Economic sector Education is 7385 when Economic sector is Education.\",\n        \"The TotalEmployed of Economic sector Wholesale and Retail is 10454 when Economic sector is Wholesale and Retail.\",\n        \"The Sex Female accounts for 44.70% of the TotalEmployed when Sex is Female.\",\n        \"The Sex Male accounts for 48.14% of the TotalEmployed when Sex is Male.\",\n        \"The Economic sector Accommodation and Food accounts for 76.28% of the TotalEmployed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Social Work and Health  accounts for 51.64% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The TotalEmployed of Sex Female is 14021 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 30646 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 5982 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 7385 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 7350 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 10454 when Sex is Male.\",\n        \"The Economic sector Agriculture and Fishing accounts for 31.39% of the TotalEmployed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 68.61% of the TotalEmployed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Wholesale and Retail accounts for 41.28% of the TotalEmployed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 58.72% of the TotalEmployed when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"In Solomon Islands, Agriculture and Fishing, Wholesale and Retail, and Education are the largest economic sectors by TotalEmployed, with notable contributions from both males and females, where Agriculture and Fishing employs the highest number overall.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Accommodation and Food accounts for 76.28% of the TotalEmployed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Social Work and Health  accounts for 51.64% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Support Service accounts for 79.16% of the TotalEmployed when Economic sector is Support Service.\",\n        \"The Economic sector Transportation and Storage accounts for 94.95% of the TotalEmployed when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Construction accounts for 97.81% of the TotalEmployed when Economic sector is Construction.\"\n      ],\n      \"insight\": \"Certain economic sectors in Solomon Islands, such as Construction, Transportation and Storage, Support Service, and Accommodation and Food, have a high concentration of TotalEmployed concentrated within each sector itself, indicating limited employment diversity within these sectors.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Male is 30646 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 14021 when Sex is Female.\",\n        \"The Sex Male accounts for 48.14% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Female accounts for 44.70% of the TotalEmployed when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 3,069 more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 1,368 more than that of Female when Sex is Female.\"\n      ],\n      \"insight\": \"The TotalEmployed male workforce in Solomon Islands significantly outnumbers the female workforce, with males accounting for a slightly higher percentage of TotalEmployed compared to females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Wholesale and Retail is 10454 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 41.28% of the TotalEmployed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 58.72% of the TotalEmployed when Economic sector is Wholesale and Retail.\",\n        \"The TotalEmployed of Sex Female is 7350 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 10454 when Sex is Male.\"\n      ],\n      \"insight\": \"Wholesale and Retail sector in Solomon Islands employs a substantial workforce, with males representing a larger share of employment than females within this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Education accounts for 44.75% of the TotalEmployed when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 55.25% of the TotalEmployed when Economic sector is Education.\",\n        \"The TotalEmployed of Sex Female is 5982 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 7385 when Sex is Male.\"\n      ],\n      \"insight\": \"In the Education sector of Solomon Islands, employment is relatively balanced between sexes with females making up a significant portion but males slightly outnumbering females overall.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Female is 11962 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 19655 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 7898 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 3281 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 3071 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 1722 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 660 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 507 when Sex is Male.\"\n      ],\n      \"insight\": \"Male employment numbers are generally higher than female employment numbers across the dataset for Pacific Island countries, indicating a gender gap in employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 11962 when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 19655 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 37.83% of the Number of employed persons when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 62.17% of the Number of employed persons when Economic sector is Agriculture and Fishing.\"\n      ],\n      \"insight\": \"Agriculture and Fishing is a major economic sector in Pacific Island countries, accounting for between approximately 38% to 62% of total employment, showing significant sectoral dominance.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 7898 when Economic sector is Wholesale and Retail.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 3281 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 70.65% of the Number of employed persons when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 29.35% of the Number of employed persons when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"Wholesale and Retail sectors in Pacific Island countries have a high employment concentration, with over 70% in some cases, highlighting their importance in the labor market.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Construction is 133 when Economic sector is Construction.\",\n        \"The Number of employed persons of Economic sector Construction is 3165 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 4.03% of the Number of employed persons when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 95.97% of the Number of employed persons when Economic sector is Construction.\"\n      ],\n      \"insight\": \"The Construction sector shows highly uneven employment figures in Pacific Island countries, varying dramatically from less than 5% to nearly 96%, suggesting disparities across countries or sub-regions.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Education accounts for 64.07% of the Number of employed persons when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 35.93% of the Number of employed persons when Economic sector is Education.\",\n        \"The Number of employed persons of Economic sector Education is 3071 when Economic sector is Education.\",\n        \"The Number of employed persons of Economic sector Education is 1722 when Economic sector is Education.\"\n      ],\n      \"insight\": \"Education sector employment in Pacific Island countries accounts for a substantial share of employment, ranging from about 36% to 64%, indicating its vital role in the economies.\"\n    }\n  ]\n}"
  ]
}