{
  "timestamp": "2025-11-13T08:50:33.635809Z",
  "chart_title_list": [
    "Employment Numbers Across Pacific Island Countries",
    "Gender Employment in Agriculture Across Countries",
    "Employed Persons by Sex Across Countries",
    "Employment Numbers by Sex Across Sectors",
    "Employment by Sector and Sex in Solomon Islands",
    "Employment by Sector and Sex in Vanuatu"
  ],
  "chart_pattern": [
    "The most striking pattern in this chart is the significant difference in employment numbers, with the Solomon Islands and Vanuatu far outpacing other Pacific Island countries. This could reflect larger populations or more diversified economies capable of supporting higher employment. In contrast, smaller nations like Niue and Tokelau show minimal employment figures, possibly due to limited economic activity or smaller labor markets. These disparities highlight the varied economic scales and development stages across the region, which may have implications for policy focus and resource allocation.",
    "The most striking pattern in this chart is the large disparity between male and female employment in agriculture across most Pacific Island countries, with males consistently outnumbering females by a wide margin. Notably, Solomon Islands and Vanuatu have the highest employment figures overall, with a pronounced gender gap favoring males. This may reflect traditional gender roles and socioeconomic factors that limit women’s participation in the agricultural labor force. The relatively smaller female employment numbers could imply challenges in access to resources, land, or labor opportunities for women. Understanding these gender dynamics is crucial for addressing equity and boosting agricultural productivity in the region.",
    "The chart reveals a consistent pattern where males generally have higher employment numbers than females across nearly all listed Pacific Island countries, with especially large gaps in Solomon Islands and Vanuatu. Notably, Tokelau and Niue show very low employment for both sexes, which could suggest smaller populations or less formal employment sectors. The pronounced disparity in countries like Solomon Islands might reflect traditional gender roles, economic opportunities, or access to employment for women. This gender gap in employment can have broader implications for economic development and social equity in these nations. Understanding these patterns highlights the importance of targeted policies to improve female workforce participation in the region.",
    "The most striking pattern in this chart is the strong male dominance in sectors like Agriculture and Fishing, and Construction, where the number of employed males far exceeds females. In contrast, sectors such as Education and Accommodation and Food show higher female employment, suggesting these may be more accessible or traditionally favored industries for women. The near parity in Social Work and Insurance employment is also notable, possibly reflecting equal opportunities or similar job roles attracting both sexes. These disparities could be influenced by societal norms, physical job demands, or historical gender roles within specific economic sectors. Understanding these trends may be crucial for developing targeted employment equity policies.",
    "The chart reveals a striking gender disparity in employment across sectors in Solomon Islands, especially in Agriculture and Fishing, where male employment vastly exceeds female employment by more than double. Conversely, the Accommodation and Food sector has a higher number of employed females than males, suggesting it might be more accessible or traditionally preferred by women. The notable dominance of males in Construction and Transportation also points to possible gender-based roles or cultural norms influencing workforce participation. This pattern might reflect broader societal structures and opportunities, highlighting areas where gender equality initiatives could be targeted.",
    "The most striking pattern is the gender disparity in Agriculture and Fishing, where male employment nearly doubles that of females. In contrast, sectors like Education and Wholesale and Retail show a reversal, with significantly more females employed than males. This may reflect traditional gender roles or educational access differences influencing workforce participation by sector. The relatively balanced numbers in Support Service and Social Work suggest these could be sectors with more gender-neutral employment opportunities. Overall, these patterns highlight how economic roles may be segmented by sex in Vanuatu, with potential implications for policy targeting gender equity in the labor market."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\",\n        \"The TotalEmployed of Pacific Island Countries Micronesia (Federated States of) is 11242 when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 10330 when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Palau is 6398 when Pacific Island Countries is Palau.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Nauru is 2314 when Pacific Island Countries is Nauru.\",\n        \"The TotalEmployed of Pacific Island Countries Tuvalu is 1501 when Pacific Island Countries is Tuvalu.\",\n        \"The TotalEmployed of Pacific Island Countries Niue is 512 when Pacific Island Countries is Niue.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 172 when Pacific Island Countries is Tokelau.\"\n      ],\n      \"insight\": [\n        \"The Solomon Islands have the highest total employment among Pacific Island Countries, with 95,024 employed individuals.\",\n        \"Vanuatu follows as the second highest in employment with 65,779 total employed.\",\n        \"Smaller island countries such as Tokelau, Niue, and Tuvalu report the lowest total employment numbers, with Tokelau having just 172 employed.\",\n        \"Mid-sized Pacific Island Countries like Samoa, Kiribati, and Tonga have employment figures ranging approximately between 16,000 and 19,000, showing moderate workforce sizes.\",\n        \"Countries such as Micronesia (Federated States of) and Marshall Islands have employment totals just above 10,000, indicating a smaller but still significant employed population.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The EmployedCount of Pacific Island Countries Solomon Islands is 30646 when Pacific Island Countries is Solomon Islands.\",\n        \"The EmployedCount of Pacific Island Countries Solomon Islands is 2.19 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 31.39% of the EmployedCount when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 68.61% of the EmployedCount when Pacific Island Countries is Solomon Islands.\"\n      ],\n      \"insight\": \"Solomon Islands has the highest employed count in agriculture among the Pacific Island Countries, with a total of 30,646 jobs representing a roughly 68:32 split between two groups.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedCount of Pacific Island Countries Vanuatu is 19655 when Pacific Island Countries is Vanuatu.\",\n        \"The EmployedCount of Pacific Island Countries Vanuatu is 1.64 times more than that of Vanuatu when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 37.83% of the EmployedCount when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 62.17% of the EmployedCount when Pacific Island Countries is Vanuatu.\"\n      ],\n      \"insight\": \"Vanuatu shows a large agricultural employment concentration with 19,655 employed, where about 62% belong to one subgroup and 38% to another.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedCount of Pacific Island Countries Samoa is 2138 when Pacific Island Countries is Samoa.\",\n        \"The EmployedCount of Pacific Island Countries Samoa is 10.85 times more than that of Samoa when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Samoa accounts for 8.44% of the EmployedCount when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Samoa accounts for 91.56% of the EmployedCount when Pacific Island Countries is Samoa.\"\n      ],\n      \"insight\": \"Samoa's employed count in agriculture stands at 2,138 with an overwhelming 91.56% belonging to one subgroup, indicating a strong subgroup dominance.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedCount of Pacific Island Countries Micronesia (Federated States of) is 779 when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The EmployedCount of Pacific Island Countries Micronesia (Federated States of) is 18.55 times more than that of Micronesia (Federated States of) when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The Pacific Island Countries Micronesia (Federated States of) accounts for 5.12% of the EmployedCount when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The Pacific Island Countries Micronesia (Federated States of) accounts for 94.88% of the EmployedCount when Pacific Island Countries is Micronesia (Federated States of).\"\n      ],\n      \"insight\": \"Micronesia (Federated States of) has a relatively small total employed count in agriculture of 779, with nearly 95% concentrated in one subgroup.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Tonga accounts for 16.60% of the EmployedCount when Pacific Island Countries is Tonga.\",\n        \"The Pacific Island Countries Tonga accounts for 83.40% of the EmployedCount when Pacific Island Countries is Tonga.\",\n        \"The EmployedCount of Pacific Island Countries Tonga is 2928 when Pacific Island Countries is Tonga.\",\n        \"The EmployedCount of Pacific Island Countries Tonga is 5.02 times more than that of Tonga when Pacific Island Countries is Tonga.\"\n      ],\n      \"insight\": \"Tonga's agricultural employment totals 2,928 with 83.40% of workers concentrated in one subgroup, demonstrating a notable subgroup disparity.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Male is 63655 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 31369 when Sex is Female.\",\n        \"The Sex Male accounts for 40.70% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Female accounts for 32.61% of the TotalEmployed when Sex is Female.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 33.01% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\"\n      ],\n      \"insight\": \"Across Pacific Island Countries, males consistently have higher total employment numbers than females, as exemplified by Solomon Islands where males represent roughly two-thirds of total employed persons.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 31369 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 63655 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 28984 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 36795 when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 44.06% of the TotalEmployed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 55.94% of the TotalEmployed when Pacific Island Countries is Vanuatu.\"\n      ],\n      \"insight\": \"The total employed population varies greatly among Pacific Island countries, with Solomon Islands and Vanuatu showing large differences between two data points while female and male shares are near balanced but male slightly dominate employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Male is 766.93 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 352.46 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 241.12 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 126.49 times more than that of Female when Sex is Female.\"\n      ],\n      \"insight\": \"Employment totals for males tend to be substantially higher than females across multiple measures, indicating significant gender disparities in employment counts within the dataset.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Cook Islands accounts for 47.43% of the TotalEmployed when Pacific Island Countries is Cook Islands.\",\n        \"The Pacific Island Countries Cook Islands accounts for 52.57% of the TotalEmployed when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 2047 when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 2269 when Pacific Island Countries is Cook Islands.\"\n      ],\n      \"insight\": \"Employed persons in Cook Islands display an almost equal gender distribution, with females and males representing near half shares of total employment and total counts close to 2,000.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 2385 more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Female is 2021 more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 3086 more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Male is 1769 more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Absolute differences in employed persons between sexes show notable increases, where male employment increments tend to be larger than female increments across similar comparisons.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 27460 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 61584 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 7429 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 6339 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 17671 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 14541 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 2981 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 2810 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 5794 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 3727 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 5839 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 11487 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 1848 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 13511 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 26883 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 24172 when Sex is Male.\"\n      ],\n      \"insight\": \"Male workers outnumber female workers in most economic sectors, especially in Agriculture and Fishing, Construction, and Transportation and Storage.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Social Work and Health  accounts for 60.85% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 39.15% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The TotalEmployed of Sex Female is 5794 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 3727 when Sex is Male.\"\n      ],\n      \"insight\": \"The Social Work and Health sector has a higher proportion and number of female employees compared to males, indicating female dominance in this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Construction is 62.23 times more than that of Construction when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 1.58% of the TotalEmployed when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 98.42% of the TotalEmployed when Economic sector is Construction.\",\n        \"The TotalEmployed of Sex Female is 256 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 15931 when Sex is Male.\"\n      ],\n      \"insight\": \"Construction is overwhelmingly male-dominated, with males accounting for over 98% of employment in this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Accommodation and Food accounts for 53.96% of the TotalEmployed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 46.04% of the TotalEmployed when Economic sector is Accommodation and Food.\",\n        \"The TotalEmployed of Sex Female is 7429 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 6339 when Sex is Male.\"\n      ],\n      \"insight\": \"The Accommodation and Food sector employs a relatively balanced number of females and males, with females accounting for a slight majority.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Sex Female accounts for 28.55% of the TotalEmployed when Sex is Female.\",\n        \"The Sex Female accounts for 27.95% of the TotalEmployed when Sex is Female.\",\n        \"The Sex Male accounts for 39.37% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Male accounts for 15.45% of the TotalEmployed when Sex is Male.\"\n      ],\n      \"insight\": \"Females generally represent a smaller share of total employment compared to males, reflecting gender distribution differences in the workforce.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Male is 30646 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 14021 when Sex is Female.\",\n        \"The Sex Male accounts for 48.14% of the Number of employed persons when Sex is Male.\",\n        \"The Sex Female accounts for 44.70% of the Number of employed persons when Sex is Female.\"\n      ],\n      \"insight\": \"Males have a higher total number of employed persons than females in the Solomon Islands, constituting a larger share of the employed population by sex.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 14021 when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 30646 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 31.39% of the Number of employed persons when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 68.61% of the Number of employed persons when Economic sector is Agriculture and Fishing.\"\n      ],\n      \"insight\": \"Agriculture and Fishing is the largest economic sector by employment in the Solomon Islands, dominating the workforce with a majority share.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 7350 when Economic sector is Wholesale and Retail.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 10454 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 41.28% of the Number of employed persons when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 58.72% of the Number of employed persons when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"Wholesale and Retail is a significant employment sector in the Solomon Islands, with a large portion of the workforce engaged in it.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Accommodation and Food is 1055 when Economic sector is Accommodation and Food.\",\n        \"The Number of employed persons of Economic sector Accommodation and Food is 328 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 76.28% of the Number of employed persons when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 23.72% of the Number of employed persons when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"Accommodation and Food sector, although smaller in absolute numbers, represents a substantial share of employment proportions within its sector in the Solomon Islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Transportation and Storage is 217 when Economic sector is Transportation and Storage.\",\n        \"The Number of employed persons of Economic sector Transportation and Storage is 4082 when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 5.05% of the Number of employed persons when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 94.95% of the Number of employed persons when Economic sector is Transportation and Storage.\"\n      ],\n      \"insight\": \"Transportation and Storage employment is dominated by one group accounting for nearly 95% of employment within that sector in the Solomon Islands.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 11962 when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 19655 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 37.83% of the Number of employed persons when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 62.17% of the Number of employed persons when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 7898 when Economic sector is Wholesale and Retail.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 3281 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 70.65% of the Number of employed persons when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 29.35% of the Number of employed persons when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"Because Agriculture and Fishing has the highest employment numbers with over 31,000 combined persons and accounts for over 62% in one case, it is the dominant economic sector in employment among Pacific Island Countries like Vanuatu.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Male is 19655 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 11962 when Sex is Female.\",\n        \"The Sex Male accounts for 53.42% of the Number of employed persons when Sex is Male.\",\n        \"The Sex Female accounts for 41.27% of the Number of employed persons when Sex is Female.\"\n      ],\n      \"insight\": \"When comparing employment by sex, males have higher total employment than females in Vanuatu, with males constituting over 53% and females about 41% of the employed persons.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Accommodation and Food is 2657 when Economic sector is Accommodation and Food.\",\n        \"The Number of employed persons of Economic sector Accommodation and Food is 2850 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 48.25% of the Number of employed persons when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 51.75% of the Number of employed persons when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"Employment in the Accommodation and Food sector is fairly balanced, accounting for around half of the workforce in this sector for Pacific Island Countries such as Vanuatu.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Transportation and Storage is 316 when Economic sector is Transportation and Storage.\",\n        \"The Number of employed persons of Economic sector Transportation and Storage is 3313 when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 8.71% of the Number of employed persons when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 91.29% of the Number of employed persons when Economic sector is Transportation and Storage.\"\n      ],\n      \"insight\": \"There is a large discrepancy in employment numbers within the Transportation and Storage sector in Pacific Island Countries, indicating uneven employment distribution or reporting in Vanuatu.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Construction is 133 when Economic sector is Construction.\",\n        \"The Number of employed persons of Economic sector Construction is 3165 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 4.03% of the Number of employed persons when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 95.97% of the Number of employed persons when Economic sector is Construction.\"\n      ],\n      \"insight\": \"Construction shows significant variability in employment, with percentages ranging from about 4% to almost 96%, highlighting inconsistencies or distinct subpopulations in the Pacific Island Countries dataset.\"\n    }\n  ]\n}"
  ]
}