{
  "timestamp": "2025-11-12T15:14:04.590979Z",
  "chart_title_list": [
    "Employment Numbers by Pacific Island Countries",
    "Solomon Islands Employment by Economic Sector",
    "Employment Counts by Sex Across Countries",
    "Employment by Sex and Sector in Cook Islands",
    "Construction Employment by Sex in Marshall Islands and Tuvalu",
    "Electricity & Gas Employment by Sex: Marshall Islands vs Palau"
  ],
  "chart_pattern": [
    "The chart reveals a striking disparity in employment numbers across Pacific Island countries, with the Solomon Islands and Vanuatu having significantly higher employment figures than all others. This sharp drop after the top two suggests a concentration of larger labor markets in just a few islands, likely due to population size and economic capacity. Smaller countries like Niue and Tokelau show minimal employment numbers, possibly reflecting limited economic activities and smaller populations. This uneven distribution highlights challenges for regional economic development and resource allocation among these diverse island nations.",
    "The most striking pattern in the employment distribution in the Solomon Islands is the dominance of the Agriculture and Fishing sector, which accounts for nearly half of all employment. This suggests a heavy reliance on primary industries, likely reflecting the country’s rural and resource-based economy. Meanwhile, sectors like Support Service make up a small fraction, indicating limited development or demand in that area. The sizable shares of Wholesale and Retail, and Education, hint at modest diversification and growing investment in basic services, which could influence future economic shifts.",
    "The most notable pattern in this chart is the consistent gender gap in employment across all Pacific Island countries, with males employed in higher numbers than females. This gap is especially pronounced in larger populations such as the Solomon Islands and Vanuatu, where male employment significantly exceeds female employment. One possible explanation could be traditional gender roles or limited access to employment opportunities for women in these regions. The disparity highlights ongoing challenges in achieving gender equality in workforce participation, which could impact economic development and social progress in these countries.",
    "The chart reveals a striking gender disparity across several sectors in the Cook Islands, with females dominating Wholesale and Retail as well as Accommodation and Food, while males overwhelmingly lead in Construction and Electricity and Gas. One notable pattern is the exclusive male presence in Construction and Electricity and Gas, suggesting potential gender-based occupational segregation or cultural influences. Meanwhile, sectors like Education and Social Work show a strong female majority, possibly reflecting traditional gender roles in caregiving professions. This distribution hints at deeply ingrained sector preferences or barriers, which could impact workforce diversity and economic equality.",
    "The chart reveals a striking disparity in construction employment between the two countries, with Marshall Islands having a substantially higher number of employed males compared to Tuvalu. Notably, the data shows employment figures exclusively for males, implying either a lack of female participation in construction or that female employment is not captured here, which can reflect gender norms or data limitations. This pronounced male dominance in construction might suggest traditional gender roles or differing economic structures in these island nations. The much lower figure for Tuvalu could also indicate a smaller construction industry or workforce size overall.",
    "The chart reveals a significant disparity in employment numbers between the Marshall Islands and Palau within the Electricity and Gas sector, with the Marshall Islands showing substantially higher employment for both males and females. Notably, males outnumber females in both countries, but this gender gap is especially pronounced in the Marshall Islands. This could reflect differences in the size of the sector or the economies of each country, or varying cultural or economic factors influencing workforce participation. The very low employment figures in Palau suggest either a smaller sector or less developed infrastructure in this industry, which might have implications for energy availability and economic development there."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\"\n      ],\n      \"insight\": \"The Solomon Islands have the largest total employment among Pacific Island Countries, followed by Vanuatu, indicating significant variation in workforce size across these countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Niue is 512 when Pacific Island Countries is Niue.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 172 when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tuvalu is 1501 when Pacific Island Countries is Tuvalu.\",\n        \"The TotalEmployed of Pacific Island Countries Nauru is 2314 when Pacific Island Countries is Nauru.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\"\n      ],\n      \"insight\": \"Smaller Pacific Island Countries such as Tokelau, Niue, Tuvalu, and Nauru have significantly smaller total employed populations compared to larger islands, demonstrating a strong scale effect on employment numbers.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 10330 when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Micronesia (Federated States of) is 11242 when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The TotalEmployed of Pacific Island Countries Palau is 6398 when Pacific Island Countries is Palau.\"\n      ],\n      \"insight\": \"Middle-sized Pacific Island Countries like Micronesia, Marshall Islands, and Palau show moderate employment figures ranging between approximately 6,000 and 11,000 total employed.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\"\n      ],\n      \"insight\": \"Kiribati, Tonga, and Samoa have relatively similar employment levels, each ranging from approximately 17,000 to 19,000, suggesting comparable workforce sizes among these countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\"\n      ],\n      \"insight\": \"Because the Solomon Islands and Vanuatu account for large shares of total employment in the region compared to smaller countries like Cook Islands, employment distribution in Pacific Island Countries is highly skewed toward few populous islands.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The EmploymentShare of SectorGroup Agriculture and Fishing is 0.4700601953190773 when SectorGroup is Agriculture and Fishing.\",\n        \"The EmploymentShare of SectorGroup Education is 0.1406697255430207 when SectorGroup is Education.\",\n        \"The EmploymentShare of SectorGroup Others is 0.1448897120727395 when SectorGroup is Others.\",\n        \"The EmploymentShare of SectorGroup Support Service is 0.0570171746085199 when SectorGroup is Support Service.\",\n        \"The EmploymentShare of SectorGroup Wholesale and Retail is 0.1873631924566425 when SectorGroup is Wholesale and Retail.\"\n      ],\n      \"insight\": [\n        \"Agriculture and Fishing dominate employment in the Solomon Islands with nearly 47% employment share, reflecting the sector's central role in the economy.\",\n        \"Wholesale and Retail is the second largest employment sector in the Solomon Islands with an employment share of approximately 18.7%, indicating significant commercial activity.\",\n        \"Education accounts for about 14% of employment, highlighting its importance as a public and private sector employer.\",\n        \"The 'Others' category comprises roughly 14.5% of employment, suggesting a diverse range of smaller or less defined industries.\",\n        \"Support Service comprises the smallest share at about 5.7%, indicating limited employment in auxiliary or support activities within the Solomon Islands.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Male is 63655 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 31369 when Sex is Female.\",\n        \"The Sex Male accounts for 40.70% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Female accounts for 32.61% of the TotalEmployed when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 1.73 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Males have a significantly higher total employment count than females across the dataset, accounting for approximately 40.7% versus 32.6% of total employed respectively.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 63655 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Sex Male is 63655 when Sex is Male.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 2.03 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\"\n      ],\n      \"insight\": \"The Solomon Islands show the highest total employment among Pacific Island Countries with a strong male dominance, where males account for nearly 67% of employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 7285 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 12024 when Sex is Male.\",\n        \"The Pacific Island Countries Samoa accounts for 37.73% of the TotalEmployed when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Samoa accounts for 62.27% of the TotalEmployed when Pacific Island Countries is Samoa.\"\n      ],\n      \"insight\": \"In Samoa, total employment shows a male majority at 62.27%, indicating a gender imbalance favoring males in employment counts.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 7169 when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Sex Male is 7169 when Sex is Male.\",\n        \"The Pacific Island Countries Marshall Islands accounts for 69.40% of the TotalEmployed when Pacific Island Countries is Marshall Islands.\",\n        \"The Sex Female accounts for 30.14% of the TotalEmployed when Sex is Female.\",\n        \"The Pacific Island Countries Marshall Islands accounts for 30.60% of the TotalEmployed when Pacific Island Countries is Marshall Islands.\"\n      ],\n      \"insight\": \"Marshall Islands exhibits a sharp male majority in employment with males making up about 69.4% of total employed, compared to females at around 30.6%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 2269 when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Sex Male is 2269 when Sex is Male.\",\n        \"The Pacific Island Countries Cook Islands accounts for 52.57% of the TotalEmployed when Pacific Island Countries is Cook Islands.\",\n        \"The Pacific Island Countries Cook Islands accounts for 47.43% of the TotalEmployed when Pacific Island Countries is Cook Islands.\"\n      ],\n      \"insight\": \"Cook Islands presents a near gender-balanced employment distribution with males slightly predominant at 52.57% of total employed.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 443 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 399 when Sex is Male.\",\n        \"The Sex Female accounts for 29.21% of the TotalEmployed when Sex is Female.\",\n        \"The Sex Male accounts for 21.86% of the TotalEmployed when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 12.72 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 11.53 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Females have a higher TotalEmployed count and percentage share compared to males in the Cook Islands employment dataset.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Social Work and Health  is 244 when Economic sector is Social Work and Health .\",\n        \"The TotalEmployed of Economic sector Social Work and Health  is 5.67 times more than that of Social Work and Health  when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 85.02% of the TotalEmployed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 14.98% of the TotalEmployed when Economic sector is Social Work and Health .\"\n      ],\n      \"insight\": \"The Social Work and Health sector exhibits the highest employment concentration, accounting for over 85% of total employment within that sector in the Cook Islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Wholesale and Retail is 598 when Economic sector is Wholesale and Retail.\",\n        \"The TotalEmployed of Economic sector Wholesale and Retail is 121 more than that of Wholesale and Retail when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 55.63% of the TotalEmployed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 44.37% of the TotalEmployed when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"Wholesale and Retail is a major sector in the Cook Islands with over half of employment concentrated within it, supported by a substantial number of total employed individuals.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Economic sector Accommodation and Food is 443 when Economic sector is Accommodation and Food.\",\n        \"The TotalEmployed of Economic sector Accommodation and Food is 44 more than that of Accommodation and Food when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 52.61% of the TotalEmployed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 47.39% of the TotalEmployed when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"The Accommodation and Food sector employs a significant portion of the workforce, accounting for approximately half of the total employment within the sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Male is 5.22 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Male is 11.09 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 9.43 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Female is 3.07 times more than that of Female when Sex is Female.\"\n      ],\n      \"insight\": \"Male employment exhibits high variability in ratios compared to female employment, indicating different concentration dynamics by sex across sectors.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Male is 4.78 times more than that of Male when Sex is Male.\",\n        \"The Sex Male accounts for 82.69% of the TotalEmployed when Sex is Male.\",\n        \"The TotalEmployed of Sex Male is 1137 when Sex is Male.\",\n        \"The TotalEmployed of Sex Male is 238 when Sex is Male.\",\n        \"The Sex Male accounts for 17.31% of the TotalEmployed when Sex is Male.\"\n      ],\n      \"insight\": [\n        \"In the Marshall Islands and Tuvalu, males dominate construction employment, representing 82.69% of total employed males.\",\n        \"The number of employed males in construction (1137) is 4.78 times higher than their female counterparts (238) in these Pacific Island countries.\",\n        \"Females represent only 17.31% of total employed persons in construction, indicating significant gender disparity.\",\n        \"Because males constitute the vast majority of construction workers, occupational roles in these Pacific Island countries are heavily gender-skewed.\",\n        \"When comparing employment by sex in construction, the data highlights a pronounced male dominance in Pacific Island countries like the Marshall Islands and Tuvalu.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Sex Female accounts for 99.40% of the TotalEmployed when Sex is Female.\",\n        \"The Sex Male accounts for 98.67% of the TotalEmployed when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 3161 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 7169 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 19 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 97 when Sex is Male.\",\n        \"The Sex Male accounts for 1.33% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Female accounts for 0.60% of the TotalEmployed when Sex is Female.\"\n      ],\n      \"insight\": [\n        \"In Electricity & Gas employment in the Marshall Islands vs Palau, females dominate total employed numbers when Sex is Female, accounting for 99.40% of employment.\",\n        \"Males also dominate total employed numbers under Sex Male, comprising 98.67% of employment in these Pacific Island countries.\",\n        \"The total number of employed males (7169) is more than double the employed females (3161) when comparing total employed by Sex in these countries.\",\n        \"Minority gender groups represent less than 2% of total employment: females account for only 0.60% when Sex is Female and males account for only 1.33% when Sex is Male.\",\n        \"The total employed count is substantially lower for the minority gender groups, with 19 females versus 97 males employed under the opposite Sex category in the dataset.\"\n      ]\n    }\n  ]\n}"
  ]
}