{
  "timestamp": "2025-11-13T06:12:38.772183Z",
  "chart_title_list": [
    "Employment Numbers Across Pacific Island Countries",
    "Gender Employment Distribution by Country",
    "Employment Numbers by Sex",
    "Sex Employment Differences by Country",
    "Employment by Economic Sector and Sex in Solomon Islands and Vanuatu",
    "Employment by Economic Sector and Sex in Palau and Kiribati"
  ],
  "chart_pattern": [
    "The most striking pattern in this chart is the exceptionally high employment number in the Solomon Islands compared to other Pacific Island countries, nearly doubling the figures of the next highest, Vanuatu. This sharp drop after the top two suggests a significant disparity in workforce size, which may be influenced by differences in population size, economic development, or labor market structure across these islands. The clustering of several countries with employment numbers below 20,000 highlights the smaller scale of their economies or populations, potentially impacting their labor market opportunities. Such disparities could have important implications for regional economic policies and support strategies.",
    "The chart reveals a consistent pattern where male employment surpasses female employment across all Pacific Island countries, with some disparities more pronounced than others. Notably, Solomon Islands and Vanuatu show the largest employment numbers overall, but the gender gap remains substantial in these countries, suggesting entrenched gender roles or labor market barriers for women. Conversely, in smaller nations like Niue and Tokelau, total employment is very low, highlighting possible population or economic scale effects rather than gender-driven differences. This persistent male dominance in employment might imply cultural or structural challenges in achieving gender parity in the workforce throughout the region.",
    "The chart reveals a significant disparity in employment numbers between males and females, with males constituting nearly two-thirds of the employed population. This difference may reflect underlying socio-economic factors such as labor market segmentation, gender roles, or educational and career opportunities that favor males in this context. It is also possible that cultural or policy-related barriers limit female participation in employment. Understanding these dynamics is crucial for addressing gender inequality and fostering a more balanced workforce.",
    "The most notable pattern in this chart is the consistently higher number of employed males compared to females across nearly all Pacific Island countries, with Solomon Islands showing the largest gap. This suggests male-dominated employment trends, possibly influenced by traditional gender roles or sector-specific labor demands. An interesting exception is Tokelau, where female and male employment numbers are nearly equal, hinting at more gender-balanced workforce participation or limited labor market size affecting both sexes similarly. The wide disparities imply varying socio-economic or cultural factors influencing employment by sex across these countries.",
    "The chart reveals a striking gender disparity in Agriculture and Fishing, where male employment is markedly higher than female employment, suggesting this sector is predominantly male-oriented. Conversely, in Wholesale and Retail, female employment slightly surpasses that of males, indicating this sector may offer more opportunities or be more attractive to women. Sectors like Education show a relatively balanced distribution, which might reflect more gender-neutral hiring or participation practices. These patterns highlight how traditional roles and possibly cultural norms influence economic participation by sex in Solomon Islands and Vanuatu. Understanding these dynamics is crucial for addressing gender inequalities in the workforce.",
    "The most striking pattern is the marked gender disparity in sectors like Agriculture and Fishing, and Construction, where male employment vastly exceeds female employment by a large margin. Conversely, sectors such as Education and Social Work and Health show a strong female dominance, indicating traditional gender roles may influence occupational choices and opportunities in these countries. The nearly balanced or female-skewed representation in Wholesale and Retail suggests this sector might offer more inclusive or accessible roles for both sexes. These contrasts could point to cultural, educational, or policy-related factors shaping employment landscapes in Palau and Kiribati. Understanding these dynamics is important for targeted workforce development and gender equity initiatives."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\"\n      ],\n      \"insight\": \"When comparing TotalEmployed across Pacific Island Countries, Solomon Islands has the highest employment number, followed by Vanuatu, indicating a significantly larger workforce in these countries than others.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Nauru is 2314 when Pacific Island Countries is Nauru.\",\n        \"The TotalEmployed of Pacific Island Countries Niue is 512 when Pacific Island Countries is Niue.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 172 when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tuvalu is 1501 when Pacific Island Countries is Tuvalu.\"\n      ],\n      \"insight\": \"Smaller Pacific Island Countries such as Niue, Tokelau, and Tuvalu have notably low TotalEmployed numbers, reflecting their smaller population sizes or labor pools.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 10330 when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Micronesia (Federated States of) is 11242 when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The TotalEmployed of Pacific Island Countries Palau is 6398 when Pacific Island Countries is Palau.\"\n      ],\n      \"insight\": \"Mid-sized Pacific Island Countries like Micronesia and the Marshall Islands show moderate TotalEmployed figures, roughly in the 6,000 to 11,000 range, between the smallest and largest countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\"\n      ],\n      \"insight\": \"Because Solomon Islands and Vanuatu dominate TotalEmployed counts among Pacific Island Countries, it suggests concentrated economic activity or larger labor forces in Melanesian nations compared to Polynesian neighbors.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\"\n      ],\n      \"insight\": \"When comparing Kiribati and Samoa, their TotalEmployed figures are close, indicating similar employment scales despite their geographic and cultural differences.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"insight\": [\n        \"The TotalEmployed in the Solomon Islands is the highest among Pacific Island Countries, being more than twice that of its own baseline and accounting for about 67% male employment.\",\n        \"Most Pacific Island Countries have a higher proportion of male TotalEmployed, with male shares generally around 55%-70%, such as Palau (61%), Tonga (61%), and Tuvalu (60%).\",\n        \"Countries like Tokelau and Niue show near-equal gender employment distribution with male and female shares close to 50%, indicating a balanced gender employment ratio.\",\n        \"The TotalEmployed in some countries like Marshall Islands and Solomon Islands is more than double their baseline, showing larger labor force participation or data scaling differences compared to smaller countries like Niue and Tokelau.\",\n        \"There is a consistent pattern that the TotalEmployed counts for males generally exceed those for females across Pacific Island Countries, with male employment often comprising 55%-70% of total employment.\"\n      ],\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 2.03 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 63655 when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Palau is 1.56 times more than that of Palau when Pacific Island Countries is Palau.\",\n        \"The TotalEmployed of Pacific Island Countries Palau is 3898 when Pacific Island Countries is Palau.\",\n        \"The Pacific Island Countries Palau accounts for 60.93% of the TotalEmployed when Pacific Island Countries is Palau.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 1.54 times more than that of Tonga when Pacific Island Countries is Tonga.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 10255 when Pacific Island Countries is Tonga.\",\n        \"The Pacific Island Countries Tonga accounts for 60.61% of the TotalEmployed when Pacific Island Countries is Tonga.\",\n        \"The TotalEmployed of Pacific Island Countries Tuvalu is 1.51 times more than that of Tuvalu when Pacific Island Countries is Tuvalu.\",\n        \"The TotalEmployed of Pacific Island Countries Tuvalu is 904 when Pacific Island Countries is Tuvalu.\",\n        \"The Pacific Island Countries Tuvalu accounts for 60.23% of the TotalEmployed when Pacific Island Countries is Tuvalu.\",\n        \"The Pacific Island Countries Tokelau accounts for 51.74% of the TotalEmployed when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 48.26% of the TotalEmployed when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Niue accounts for 48.44% of the TotalEmployed when Pacific Island Countries is Niue.\",\n        \"The Pacific Island Countries Niue accounts for 51.56% of the TotalEmployed when Pacific Island Countries is Niue.\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 2.27 times more than that of Marshall Islands when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 7169 when Pacific Island Countries is Marshall Islands.\",\n        \"The Pacific Island Countries Marshall Islands accounts for 69.40% of the TotalEmployed when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 222 more than that of Cook Islands when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 2269 when Pacific Island Countries is Cook Islands.\",\n        \"The Pacific Island Countries Cook Islands accounts for 47.43% of the TotalEmployed when Pacific Island Countries is Cook Islands.\",\n        \"The Pacific Island Countries Cook Islands accounts for 52.57% of the TotalEmployed when Pacific Island Countries is Cook Islands.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The proportion of Sex Female is 0.3807842143603712 when Sex is Female.\",\n        \"The proportion of Sex Male is 0.6192157856396288 when Sex is Male.\"\n      ],\n      \"insight\": [\n        \"Male employees constitute approximately 62% of the total employment, indicating a significant gender imbalance favoring males in the workforce.\",\n        \"Female employees make up around 38% of the total workforce, showing lower female representation compared to males in employment numbers.\",\n        \"Because males represent a majority in employment, policies aimed at improving gender parity could focus on increasing female participation.\",\n        \"When comparing proportions, the data underscores an uneven distribution between male and female employment numbers.\",\n        \"We observe that male dominance in employment is substantial, suggesting possible gender-specific trends or occupational preferences.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Sex Male accounts for 40.70% of the TotalEmployed when Sex is Male.\",\n        \"The Sex Female accounts for 32.61% of the TotalEmployed when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 63655 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 31369 when Sex is Female.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands is 2.03 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 31369 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 63655 when Pacific Island Countries is Solomon Islands.\"\n      ],\n      \"insight\": \"The Solomon Islands exhibits the largest employment difference among Pacific Island Countries, with TotalEmployed for males being more than double that of females and accounting for the majority of total employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Male is 766.93 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 352.46 times more than that of Female when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 443.31 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Male is 241.12 times more than that of Male when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 325.66 times more than that of Female when Sex is Female.\"\n      ],\n      \"insight\": \"Overall employment numbers for Sex Male are substantially higher than Sex Female across multiple comparisons, showing consistently larger employment scale differences in male categories.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Vanuatu is 7811 more than that of Vanuatu when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 28984 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 36795 when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 55.94% of the TotalEmployed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 44.06% of the TotalEmployed when Pacific Island Countries is Vanuatu.\"\n      ],\n      \"insight\": \"Vanuatu shows a large absolute increase in TotalEmployed with the Pacific Island Countries grouping, where employment totals exceed 36,000 and male employment comprises over half of the total workforce.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 3437 more than that of Kiribati when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 7665 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 11102 when Pacific Island Countries is Kiribati.\",\n        \"The Pacific Island Countries Kiribati accounts for 59.16% of the TotalEmployed when Pacific Island Countries is Kiribati.\",\n        \"The Pacific Island Countries Kiribati accounts for 40.84% of the TotalEmployed when Pacific Island Countries is Kiribati.\"\n      ],\n      \"insight\": \"Kiribati’s TotalEmployed under the Pacific Island Countries grouping grows significantly, with males making up nearly 60% of the employed population while employment increases by over 3400.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Tokelau is 6 more than that of Tokelau when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 89 when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 83 when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 51.74% of the TotalEmployed when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 48.26% of the TotalEmployed when Pacific Island Countries is Tokelau.\"\n      ],\n      \"insight\": \"Tokelau shows a nearly balanced gender employment distribution with about half of TotalEmployed by each sex, despite having the smallest absolute employment numbers among Pacific Island Countries.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Male is 3289 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 7898 when Sex is Female.\",\n        \"The Sex Male accounts for 30.51% of the Number of employed persons when Sex is Male.\",\n        \"The Sex Female accounts for 23.23% of the Number of employed persons when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 3281 when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 7350 when Sex is Female.\"\n      ],\n      \"insight\": \"Because male employment accounts for a higher percentage (around 30.51%) compared to female employment (around 23.23%) in Pacific Island Countries, we observe that males have a larger share of employment in these regions.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Accommodation and Food is 2657 when Economic sector is Accommodation and Food.\",\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 14021 when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Construction is 4340 when Economic sector is Construction.\",\n        \"The Number of employed persons of Economic sector Education is 5982 when Economic sector is Education.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 7898 when Economic sector is Wholesale and Retail.\",\n        \"The Number of employed persons of Economic sector Transportation and Storage is 4082 when Economic sector is Transportation and Storage.\"\n      ],\n      \"insight\": \"When comparing economic sectors in Pacific Island Countries, Agriculture and Fishing employs the highest number of persons, followed by Wholesale and Retail and Construction sectors.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Female is 61.67 times more than that of Female when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 133.71 times more than that of Male when Sex is Male.\",\n        \"The Number of employed persons of Sex Male is 72.60 times more than that of Male when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 44.98 times more than that of Female when Sex is Female.\",\n        \"The Number of employed persons of Sex Female is 55.26 times more than that of Female when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 62.16 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Because employment ratios for males in Pacific Island Countries exceed those for females by a considerable margin, the male workforce experiences significantly higher employment levels across sectors.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Accommodation and Food accounts for 41.36% of the Number of employed persons when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Construction accounts for 40.92% of the Number of employed persons when Economic sector is Construction.\",\n        \"The Economic sector Transportation and Storage accounts for 41.79% of the Number of employed persons when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Education accounts for 40.67% of the Number of employed persons when Economic sector is Education.\"\n      ],\n      \"insight\": \"Because Accommodation and Food, Construction, Transportation and Storage, and Education sectors each account for around 40% of employed persons in their respective sectors, these sectors dominate employment distribution within Pacific Island Countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 2059 more than that of Agriculture and Fishing when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 2556 more than that of Wholesale and Retail when Economic sector is Wholesale and Retail.\",\n        \"The Number of employed persons of Economic sector Social Work and Health is 153 more than that of Social Work and Health when Economic sector is Social Work and Health.\",\n        \"The Number of employed persons of Economic sector Support Service is 558 more than that of Support Service when Economic sector is Support Service.\"\n      ],\n      \"insight\": \"We observe that Agriculture and Fishing and Wholesale and Retail sectors show substantially higher absolute employment increases compared to Social Work and Health and Support Service sectors in Pacific Island Countries.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Female is 3483 when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 3765 when Sex is Male.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 3483 when Economic sector is Wholesale and Retail.\",\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 3765 when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Accommodation and Food is 543 when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"In Palau and Kiribati, males have a higher number of employed persons than females, with 3765 males employed versus 3483 females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Agriculture and Fishing is 3765 when Economic sector is Agriculture and Fishing.\",\n        \"The Number of employed persons of Economic sector Wholesale and Retail is 3483 when Economic sector is Wholesale and Retail.\",\n        \"The Number of employed persons of Economic sector Accommodation and Food is 543 when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"Agriculture and Fishing and Wholesale and Retail are the top two economic sectors by employment volume in Palau and Kiribati, greatly surpassing Accommodation and Food.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Wholesale and Retail accounts for 47.23% of the Number of employed persons when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Construction accounts for 46.15% of the Number of employed persons when Economic sector is Construction.\",\n        \"The Economic sector Support Service accounts for 42.53% of the Number of employed persons when Economic sector is Support Service.\"\n      ],\n      \"insight\": \"The Wholesale and Retail, Construction, and Support Service sectors each account for over 40% of their respective employment counts, indicating these sectors dominate employment composition within their categories.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Sex Male is 52.97 times more than that of Male when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 44.11 times more than that of Female when Sex is Female.\",\n        \"The Number of employed persons of Sex Male is 43.28 times more than that of Male when Sex is Male.\",\n        \"The Number of employed persons of Sex Female is 41.96 times more than that of Female when Sex is Female.\"\n      ],\n      \"insight\": \"Employment counts for both males and females show substantial variation across different economic sectors, with some sectors employing over 40 times more persons than others.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Number of employed persons of Economic sector Transportation and Storage is 32.98 times more than that of Transportation and Storage when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 70.91% of the Number of employed persons when Economic sector is Transportation and Storage.\"\n      ],\n      \"insight\": \"The Transportation and Storage sector is highly concentrated, with over 70% of employment represented by a dominant subgroup within this sector in Palau and Kiribati.\"\n    }\n  ]\n}"
  ]
}