{
  "timestamp": "2025-11-13T01:36:53.293037Z",
  "chart_title_list": [
    "Employment Numbers by Pacific Island Countries",
    "Employment by Sex Across Pacific Island Countries",
    "Employment by Sex Across Pacific Island Countries",
    "Employment by Sex Within Key Economic Sectors",
    "Employment by Sex across Sectors in Solomon Islands",
    "Employment by Sex across Sectors in Vanuatu"
  ],
  "chart_pattern": [
    "The chart reveals a striking disparity in employment numbers across the Pacific Island countries, with the Solomon Islands having nearly one and a half times more employed persons than the next highest, Vanuatu. Most other countries show significantly lower employment figures, suggesting a concentrated labor market in a few larger or more economically active nations. This imbalance could reflect differences in population size, economic development, or available industries, which may lead to varied challenges in employment opportunities and economic stability across the region. The steep drop after the top two nations underscores potential room for economic growth in smaller countries.",
    "The chart reveals a consistent pattern where male employment generally surpasses female employment across most Pacific Island countries, with some exceptions like Cook Islands where females slightly outnumber males. Notably, Tokelau shows an extreme disparity with a very high number of employed males compared to females, suggesting possible cultural or economic factors influencing gender roles in employment. This large gap might reflect limited employment opportunities for women or traditional labor divisions in certain islands. The relatively balanced figures in countries like Niue and Tuvalu could indicate more gender-inclusive labor markets. Overall, these variations highlight the diverse socio-economic landscapes shaping employment by sex within the region.",
    "The chart reveals a consistent pattern of higher male employment compared to female employment across almost all Pacific Island countries, with Solomon Islands and Vanuatu showing particularly large disparities. Notably, the difference in the Solomon Islands is striking, where male employment nearly doubles that of females, suggesting potential gender-specific economic roles or labor market barriers. Smaller countries like Niue and Tuvalu show low overall employment with less pronounced gender gaps, possibly due to smaller populations or limited job opportunities. This widespread imbalance could reflect cultural norms or structural factors influencing workforce participation rates between sexes in the region. Understanding these dynamics is crucial for formulating gender-inclusive employment policies.",
    "The chart shows a significant gender disparity in employment within the Agriculture and Fishing sector, with males outnumbering females by more than double. This difference may reflect traditional gender roles or access to certain types of labor within these industries. It could also indicate variations in opportunities, training, or cultural expectations that influence workforce composition. Understanding these dynamics is important for addressing gender equity and fostering inclusive economic development in these key sectors.",
    "The most striking pattern in this chart is the significant gender disparity in the Agriculture and Fishing sector, where male employment vastly exceeds female employment by a large margin. In contrast, sectors like Accommodation and Food, and Education show either a female majority or a more balanced distribution, suggesting these may be more accessible or preferred by women. This disparity might reflect traditional gender roles or differences in the types of work available or culturally accepted within the Solomon Islands. The dominance of males in physically demanding sectors like Agriculture could also influence economic power dynamics and labor policies in the country. Understanding these patterns is crucial for designing targeted employment programs that promote gender equity across sectors.",
    "The most striking pattern in the chart is the significant gender disparity in the Agriculture and Fishing sector, where male employment far exceeds female employment. Conversely, the Wholesale and Retail sector shows a notable female dominance, with women employed at more than twice the number of men. This contrast may reflect traditional gender roles or societal norms influencing job access and preferences within Vanuatu. Additionally, sectors like Education have a relatively balanced distribution but still lean toward more female employees, possibly indicating gendered career choices or educational opportunities. These disparities highlight the potential need for policies promoting gender equality across all economic sectors."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The Total_Employed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\",\n        \"The Total_Employed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The Total_Employed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The Total_Employed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\"\n      ],\n      \"insight\": \"The Solomon Islands has the largest number of total employed people among Pacific Island Countries, followed by Vanuatu and Samoa.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Pacific Island Countries Niue is 512 when Pacific Island Countries is Niue.\",\n        \"The Total_Employed of Pacific Island Countries Tokelau is 172 when Pacific Island Countries is Tokelau.\",\n        \"The Total_Employed of Pacific Island Countries Tuvalu is 1501 when Pacific Island Countries is Tuvalu.\",\n        \"The Total_Employed of Pacific Island Countries Nauru is 2314 when Pacific Island Countries is Nauru.\"\n      ],\n      \"insight\": \"Some Pacific Island Countries like Tokelau, Niue, Tuvalu, and Nauru have notably smaller total employment numbers compared to others.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Pacific Island Countries Micronesia (Federated States of) is 11242 when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The Total_Employed of Pacific Island Countries Marshall Islands is 10330 when Pacific Island Countries is Marshall Islands.\"\n      ],\n      \"insight\": \"Micronesia (Federated States of) and Marshall Islands have similar employment sizes, each around 10,000 total employed.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Pacific Island Countries Palau is 6398 when Pacific Island Countries is Palau.\",\n        \"The Total_Employed of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\"\n      ],\n      \"insight\": \"Palau and Cook Islands represent mid-range total employment numbers among Pacific Island Countries, with Palau employing more than Cook Islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The Total_Employed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The Total_Employed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\"\n      ],\n      \"insight\": \"Samoa, Kiribati, and Tonga have total employed figures ranging between approximately 16,900 and 19,300, indicating moderate employment levels among Pacific Island Countries.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Pacific Island Countries Solomon Islands is 2.03 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The Total_Employed of Pacific Island Countries Solomon Islands is 63655 when Pacific Island Countries is Solomon Islands.\",\n        \"The Total_Employed of Pacific Island Countries Vanuatu is 7811 more than that of Vanuatu when Pacific Island Countries is Vanuatu.\",\n        \"The Total_Employed of Pacific Island Countries Vanuatu is 36795 when Pacific Island Countries is Vanuatu.\",\n        \"The Total_Employed of Pacific Island Countries Kiribati is 3437 more than that of Kiribati when Pacific Island Countries is Kiribati.\",\n        \"The Total_Employed of Pacific Island Countries Kiribati is 11102 when Pacific Island Countries is Kiribati.\"\n      ],\n      \"insight\": \"Among Pacific Island Countries, Solomon Islands has the highest total employment, more than twice its baseline, followed by Vanuatu and Kiribati with significantly higher employed populations.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Samoa accounts for 37.73% of the Total_Employed when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Samoa accounts for 62.27% of the Total_Employed when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 33.01% of the Total_Employed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the Total_Employed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Vanuatu accounts for 44.06% of the Total_Employed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 55.94% of the Total_Employed when Pacific Island Countries is Vanuatu.\"\n      ],\n      \"insight\": \"Employment distribution by gender in key Pacific Island Countries shows that males generally constitute a larger share, exemplified by Samoa, Solomon Islands, and Vanuatu where males account for over 55% of total employed.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Pacific Island Countries Tokelau is 6 more than that of Tokelau when Pacific Island Countries is Tokelau.\",\n        \"The Total_Employed of Pacific Island Countries Tokelau is 89 when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 51.74% of the Total_Employed when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 48.26% of the Total_Employed when Pacific Island Countries is Tokelau.\"\n      ],\n      \"insight\": \"Tokelau has the smallest total employment among Pacific Island Countries but exhibits a nearly even gender employment split close to 50/50.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Pacific Island Countries Marshall Islands is 2.27 times more than that of Marshall Islands when Pacific Island Countries is Marshall Islands.\",\n        \"The Total_Employed of Pacific Island Countries Marshall Islands is 7169 when Pacific Island Countries is Marshall Islands.\",\n        \"The Pacific Island Countries Marshall Islands accounts for 30.60% of the Total_Employed when Pacific Island Countries is Marshall Islands.\",\n        \"The Pacific Island Countries Marshall Islands accounts for 69.40% of the Total_Employed when Pacific Island Countries is Marshall Islands.\"\n      ],\n      \"insight\": \"Marshall Islands shows a strong male employment dominance with males comprising nearly 70% of total employed while total employment is more than double its baseline.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Sex Female is 2047 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 2269 when Sex is Male.\",\n        \"The Total_Employed of Sex Male is 2269 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 2047 when Sex is Female.\"\n      ],\n      \"insight\": \"Across the Pacific Island Countries dataset, total employment numbers for males and females show comparable figures in some cases, indicating balanced gender employment in smaller populations.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Sex Male is 63655 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 31369 when Sex is Female.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 33.01% of the Total_Employed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the Total_Employed when Pacific Island Countries is Solomon Islands.\"\n      ],\n      \"insight\": \"In Solomon Islands, the Total_Employed of Sex Male is more than double that of Sex Female, comprising nearly 67% of total employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Sex Male is 12024 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 7285 when Sex is Female.\",\n        \"The Pacific Island Countries Samoa accounts for 37.73% of the Total_Employed when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Samoa accounts for 62.27% of the Total_Employed when Pacific Island Countries is Samoa.\"\n      ],\n      \"insight\": \"Samoa's Total_Employed population shows males outnumber females significantly, with males accounting for over 62% of employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Sex Male is 6598 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 4644 when Sex is Female.\",\n        \"The Pacific Island Countries Micronesia (Federated States of) accounts for 41.31% of the Total_Employed when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The Pacific Island Countries Micronesia (Federated States of) accounts for 58.69% of the Total_Employed when Pacific Island Countries is Micronesia (Federated States of).\"\n      ],\n      \"insight\": \"In Micronesia (Federated States of), females hold a majority share of employment at nearly 59%, while males represent about 41%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Sex Male is 11102 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 7665 when Sex is Female.\",\n        \"The Pacific Island Countries Kiribati accounts for 40.84% of the Total_Employed when Pacific Island Countries is Kiribati.\",\n        \"The Pacific Island Countries Kiribati accounts for 59.16% of the Total_Employed when Pacific Island Countries is Kiribati.\"\n      ],\n      \"insight\": \"Kiribati exhibits a higher female employment proportion of 59% compared to males at 41%, with Total_Employed male and female counts reflecting this split.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Sex Male is 36795 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 28984 when Sex is Female.\",\n        \"The Pacific Island Countries Vanuatu accounts for 44.06% of the Total_Employed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 55.94% of the Total_Employed when Pacific Island Countries is Vanuatu.\"\n      ],\n      \"insight\": \"Vanuatu's employment distribution shows females represent nearly 56% of total employment, slightly outnumbering males who account for 44%.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Sex Female is 27460 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 61584 when Sex is Male.\",\n        \"The Economic sector Agriculture and Fishing accounts for 30.84% of the Total_Employed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 69.16% of the Total_Employed when Economic sector is Agriculture and Fishing.\"\n      ],\n      \"insight\": [\n        \"When comparing the Agricultural and Fishing sector, males account for 69.16% of total employment while females represent 30.84%.\",\n        \"The total number of employed males (61,584) in the Agriculture and Fishing sector is over twice the number of employed females (27,460).\",\n        \"Because males dominate total employment in Agriculture and Fishing, this sector shows a significant gender employment disparity.\",\n        \"We observe that in this key economic sector, the workforce is predominantly male by a factor of approximately 2.24 times.\",\n        \"Employment by sex within Agriculture and Fishing highlights the concentration of male employment relative to female employment in this sector.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Economic sector Accommodation and Food is 1055 when Economic sector is Accommodation and Food.\",\n        \"The Total_Employed of Economic sector Agriculture and Fishing is 14021 when Economic sector is Agriculture and Fishing.\",\n        \"The Total_Employed of Economic sector Construction is 4340 when Economic sector is Construction.\",\n        \"The Total_Employed of Economic sector Education is 7385 when Economic sector is Education.\",\n        \"The Total_Employed of Economic sector Financial and Insurance is 987 when Economic sector is Financial and Insurance.\",\n        \"The Total_Employed of Economic sector Social Work and Health  is 1068 when Economic sector is Social Work and Health .\",\n        \"The Total_Employed of Economic sector Support Service is 4289 when Economic sector is Support Service.\",\n        \"The Total_Employed of Economic sector Transportation and Storage is 4082 when Economic sector is Transportation and Storage.\",\n        \"The Total_Employed of Economic sector Wholesale and Retail is 10454 when Economic sector is Wholesale and Retail.\",\n        \"The Sex Female accounts for 44.70% of the Total_Employed when Sex is Female.\",\n        \"The Sex Male accounts for 48.14% of the Total_Employed when Sex is Male.\"\n      ],\n      \"insight\": \"In Solomon Islands, Agriculture and Fishing along with Wholesale and Retail sectors employ the largest number of people across Pacific Island countries, with female workers representing nearly 45% and males slightly above 48% of total employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Accommodation and Food accounts for 76.28% of the Total_Employed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Social Work and Health  accounts for 51.64% of the Total_Employed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Education accounts for 44.75% of the Total_Employed when Economic sector is Education.\",\n        \"The Economic sector Wholesale and Retail accounts for 58.72% of the Total_Employed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Support Service accounts for 79.16% of the Total_Employed when Economic sector is Support Service.\"\n      ],\n      \"insight\": \"Employment concentration varies widely by sector with Support Service and Accommodation and Food sectors having the highest proportion of total employment, exceeding 75%, indicating strong sectoral dominance in Solomon Islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Sex Female is 14021 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 30646 when Sex is Male.\",\n        \"The Sex Female accounts for 44.70% of the Total_Employed when Sex is Female.\",\n        \"The Sex Male accounts for 48.14% of the Total_Employed when Sex is Male.\"\n      ],\n      \"insight\": \"Male employment numbers in Solomon Islands substantially exceed female employment, with males accounting for about 48% and females approximately 45% of the total employed workforce across Pacific Island countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Economic sector Construction is 4340 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 97.81% of the Total_Employed when Economic sector is Construction.\",\n        \"The Total_Employed of Economic sector Transportation and Storage is 4082 when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 94.95% of the Total_Employed when Economic sector is Transportation and Storage.\"\n      ],\n      \"insight\": \"The Construction and Transportation & Storage sectors show very high employment concentration rates over 94%, highlighting few dominating employers or very focused workforce distribution within these sectors in Solomon Islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Sex Female is 1055 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 328 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 5982 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 7385 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 450 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 987 when Sex is Male.\"\n      ],\n      \"insight\": \"Employment levels for females and males show sectoral variation, with some sectors like Education employing more males than females and others showing the opposite, reflecting gender distribution differences across economic sectors in Solomon Islands.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Economic sector Agriculture and Fishing is 11962 when Economic sector is Agriculture and Fishing.\",\n        \"The Total_Employed of Economic sector Agriculture and Fishing is 19655 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 37.83% of the Total_Employed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 62.17% of the Total_Employed when Economic sector is Agriculture and Fishing.\",\n        \"The Total_Employed of Economic sector Construction is 133 when Economic sector is Construction.\",\n        \"The Total_Employed of Economic sector Construction is 3165 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 4.03% of the Total_Employed when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 95.97% of the Total_Employed when Economic sector is Construction.\",\n        \"The Total_Employed of Sex Female is 11962 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 19655 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 133 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 3165 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 3071 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 1722 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 7898 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 3281 when Sex is Male.\"\n      ],\n      \"insight\": \"Employment in Agriculture and Fishing in Vanuatu is substantially larger than in Construction, with Agriculture and Fishing accounting for between 37.83% and 62.17% of total employment compared to Construction's 4.03% to 95.97%, indicating strong sectoral differences across Pacific Island countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Sex Male is 19655 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 11962 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 3165 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 133 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 3281 when Sex is Male.\",\n        \"The Total_Employed of Sex Female is 7898 when Sex is Female.\",\n        \"The Total_Employed of Sex Female is 600 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 493 when Sex is Male.\"\n      ],\n      \"insight\": \"Male employment numbers in Vanuatu are generally higher than female employment across most economic sectors, such as Agriculture and Fishing and Construction, highlighting a gender disparity in occupational participation.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Wholesale and Retail accounts for 70.65% of the Total_Employed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 29.35% of the Total_Employed when Economic sector is Wholesale and Retail.\",\n        \"The Total_Employed of Economic sector Wholesale and Retail is 7898 when Economic sector is Wholesale and Retail.\",\n        \"The Total_Employed of Economic sector Wholesale and Retail is 3281 when Economic sector is Wholesale and Retail.\",\n        \"The Total_Employed of Sex Female is 7898 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 3281 when Sex is Male.\"\n      ],\n      \"insight\": \"Wholesale and Retail sector in Vanuatu has a high proportion of female employment compared to males, with females accounting for up to 70.65% of employment in that sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Education accounts for 64.07% of the Total_Employed when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 35.93% of the Total_Employed when Economic sector is Education.\",\n        \"The Total_Employed of Economic sector Education is 3071 when Economic sector is Education.\",\n        \"The Total_Employed of Economic sector Education is 1722 when Economic sector is Education.\",\n        \"The Total_Employed of Sex Female is 3071 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 1722 when Sex is Male.\"\n      ],\n      \"insight\": \"The Education sector in Vanuatu employs more females than males, with females constituting up to 64.07% of total employment in that sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Total_Employed of Economic sector Accommodation and Food is 2657 when Economic sector is Accommodation and Food.\",\n        \"The Total_Employed of Economic sector Accommodation and Food is 2850 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 48.25% of the Total_Employed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 51.75% of the Total_Employed when Economic sector is Accommodation and Food.\",\n        \"The Total_Employed of Sex Female is 2657 when Sex is Female.\",\n        \"The Total_Employed of Sex Male is 2850 when Sex is Male.\"\n      ],\n      \"insight\": \"Employment in the Accommodation and Food sector is almost evenly split between males and females in Vanuatu, each accounting for about half of the sector's total employment.\"\n    }\n  ]\n}"
  ]
}