{
  "timestamp": "2025-11-13T06:00:51.501629Z",
  "chart_title_list": [
    "Employment Numbers by Pacific Island Countries",
    "Gender Employment Distribution Across Countries",
    "Employment Numbers by Sex and Economic Sector",
    "Employment by Sex in Two Key Economic Sectors",
    "Employment by Sex and Sector in Solomon Islands",
    "Employment by Sex and Sector in Vanuatu"
  ],
  "chart_pattern": [
    "The chart reveals a significant disparity in employment numbers among Pacific Island countries, with the Solomon Islands and Vanuatu having notably higher employment figures compared to others. This sharp contrast may reflect differences in population size, economic activity, or labor market opportunities within these nations. Interestingly, smaller countries like Tuvalu, Niue, and Tokelau show very low employment numbers, which could indicate limited job availability or smaller labor forces. These variations highlight potential challenges and opportunities for regional economic development and workforce planning.",
    "The chart reveals a consistent pattern of male employment surpassing female employment across most Pacific Island countries, with a particularly pronounced gap in the Solomon Islands. Interestingly, some smaller nations like Nauru and Niue show minimal gender disparity, hinting at more balanced employment or smaller workforce sizes. This male-dominant employment trend might reflect cultural, economic, or educational factors limiting women's participation in the workforce. The significant differences in larger countries could impact economic development and gender equality initiatives in the region. Overall, these disparities underscore the need to explore targeted policies encouraging more inclusive employment opportunities for women.",
    "The most striking pattern is the significant gender disparity in Agriculture and Fishing, where male employment far surpasses female employment, suggesting this sector is predominantly male-dominated, possibly due to the physical demands or traditional roles associated with it. Conversely, sectors like Education and Accommodation and Food exhibit higher female employment, indicating these fields might be more accessible or attractive to women. Interestingly, Wholesale and Retail shows nearly balanced employment, hinting at a more gender-neutral environment. These variances could reflect both societal norms and economic structures influencing job opportunities by sex across sectors.",
    "The chart reveals a notable gender difference in employment between the two sectors. In Financial and Insurance, females slightly outnumber males, suggesting a relatively balanced or even female-leaning workforce in that sector. In contrast, Social Work and Health show a much larger female majority compared to males, indicating this sector is dominated by female employment. This pattern could reflect societal norms or gender roles influencing career choices, with women more represented in caregiving professions and men less so. It also highlights how gender dynamics vary distinctly across different economic fields.",
    "The most striking pattern is the tremendous gender disparity within the Agriculture and Fishing sector, where male employment far exceeds female employment by a large margin. This may reflect traditional gender roles or access to resources and opportunities in this key sector of Solomon Islands' economy. Conversely, sectors like Education and Health show a more balanced gender distribution, suggesting these fields may offer more equal employment opportunities. The dominance of males in sectors such as Construction and Wholesale and Retail also highlights persistent occupational segregation by sex. These differences could have implications for economic development and gender equality initiatives in the region.",
    "The most notable pattern is the stark gender imbalance in several key sectors, particularly Agriculture and Fishing, and Construction, where male employment far exceeds female. Conversely, sectors like Education and Wholesale and Retail show higher female employment, indicating traditional gender roles may influence occupational distribution. This disparity could reflect cultural factors or accessibility differences, potentially impacting economic growth and gender equality. Addressing these gaps might unlock untapped talent and promote more inclusive development in Vanuatu’s economy."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\"\n      ],\n      \"insight\": \"Among Pacific Island Countries, Solomon Islands has the largest employed population, followed by Vanuatu, Samoa, Kiribati, and Tonga, indicating significant variation in employment scale.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Tuvalu is 1501 when Pacific Island Countries is Tuvalu.\",\n        \"The TotalEmployed of Pacific Island Countries Niue is 512 when Pacific Island Countries is Niue.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 172 when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Nauru is 2314 when Pacific Island Countries is Nauru.\",\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\"\n      ],\n      \"insight\": \"Smaller Pacific Island Countries such as Tokelau, Niue, and Tuvalu have notably lower total employment numbers compared to larger countries, highlighting the scale effect on employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Micronesia (Federated States of) is 11242 when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 10330 when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Palau is 6398 when Pacific Island Countries is Palau.\"\n      ],\n      \"insight\": \"Micronesia (Federated States of), Marshall Islands, and Palau have mid-range total employment numbers among Pacific Island Countries, indicating a moderate employment base.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\"\n      ],\n      \"insight\": \"Because Solomon Islands and Vanuatu have substantially higher total employed populations than other Pacific Island Countries, employment policies and economic conditions in these countries likely influence regional employment statistics.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\"\n      ],\n      \"insight\": \"Comparing Cook Islands and Kiribati reveals that Kiribati has over four times more total employed individuals, underscoring differences in workforce size among Pacific Island Countries.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Employed of Pacific Island Countries Solomon Islands is 2.03 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The Employed of Pacific Island Countries Marshall Islands is 2.27 times more than that of Marshall Islands when Pacific Island Countries is Marshall Islands.\",\n        \"The Employed of Pacific Island Countries Samoa is 1.65 times more than that of Samoa when Pacific Island Countries is Samoa.\",\n        \"The Employed of Pacific Island Countries Palau is 1.56 times more than that of Palau when Pacific Island Countries is Palau.\",\n        \"The Employed of Pacific Island Countries Tonga is 1.54 times more than that of Tonga when Pacific Island Countries is Tonga.\",\n        \"The Employed of Pacific Island Countries Tuvalu is 1.51 times more than that of Tuvalu when Pacific Island Countries is Tuvalu.\"\n      ],\n      \"insight\": \"Certain Pacific Island Countries such as Solomon Islands and Marshall Islands show more than double the employed population compared to their baseline, indicating significant employment size variation within the region.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Kiribati accounts for 40.84% of the Employed when Pacific Island Countries is Kiribati.\",\n        \"The Pacific Island Countries Kiribati accounts for 59.16% of the Employed when Pacific Island Countries is Kiribati.\",\n        \"The Pacific Island Countries Micronesia (Federated States of) accounts for 41.31% of the Employed when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The Pacific Island Countries Micronesia (Federated States of) accounts for 58.69% of the Employed when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The Pacific Island Countries Vanuatu accounts for 44.06% of the Employed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 55.94% of the Employed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Palau accounts for 39.07% of the Employed when Pacific Island Countries is Palau.\",\n        \"The Pacific Island Countries Palau accounts for 60.93% of the Employed when Pacific Island Countries is Palau.\"\n      ],\n      \"insight\": \"Employment distribution in Pacific Island Countries often shows a near 40%-60% split, highlighting a balanced gender or sectoral contribution to employment across countries like Kiribati, Micronesia, and Palau.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Pacific Island Countries Vanuatu is 7811 more than that of Vanuatu when Pacific Island Countries is Vanuatu.\",\n        \"The Employed of Pacific Island Countries Solomon Islands is 31369 when Pacific Island Countries is Solomon Islands.\",\n        \"The Employed of Pacific Island Countries Solomon Islands is 63655 when Pacific Island Countries is Solomon Islands.\",\n        \"The Employed of Pacific Island Countries Kiribati is 3437 more than that of Kiribati when Pacific Island Countries is Kiribati.\",\n        \"The Employed of Pacific Island Countries Kiribati is 7665 when Pacific Island Countries is Kiribati.\"\n      ],\n      \"insight\": \"Countries like Solomon Islands and Vanuatu have substantial employed populations, with Solomon Islands having the highest employment figures among Pacific Island Countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Pacific Island Countries Tokelau is 6 more than that of Tokelau when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 51.74% of the Employed when Pacific Island Countries is Tokelau.\"\n      ],\n      \"insight\": \"Tokelau exhibits a very small employed population with a near-equal employment distribution split around 50%, indicating a small labor market with balanced employment participation.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Cook Islands accounts for 47.43% of the Employed when Pacific Island Countries is Cook Islands.\",\n        \"The Pacific Island Countries Cook Islands accounts for 52.57% of the Employed when Pacific Island Countries is Cook Islands.\",\n        \"The Employed of Pacific Island Countries Cook Islands is 222 more than that of Cook Islands when Pacific Island Countries is Cook Islands.\",\n        \"The Employed of Pacific Island Countries Cook Islands is 2047 when Pacific Island Countries is Cook Islands.\",\n        \"The Employed of Pacific Island Countries Cook Islands is 2269 when Pacific Island Countries is Cook Islands.\"\n      ],\n      \"insight\": \"Cook Islands shows a balanced employment split close to 50% each side with a modest difference in employed counts that reflect stability in employment structure.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 27460 when Sex is Female.\",\n        \"The Employed of Sex Male is 61584 when Sex is Male.\",\n        \"The Economic sector Agriculture and Fishing accounts for 30.84% of the Employed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 69.16% of the Employed when Economic sector is Agriculture and Fishing.\",\n        \"The Employed of Sex Female is 17671 when Sex is Female.\",\n        \"The Employed of Sex Male is 14541 when Sex is Male.\",\n        \"The Economic sector Education accounts for 54.86% of the Employed when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 45.14% of the Employed when Economic sector is Education.\",\n        \"The Employed of Sex Female is 26883 when Sex is Female.\",\n        \"The Employed of Sex Male is 24172 when Sex is Male.\",\n        \"The Economic sector Wholesale and Retail accounts for 52.65% of the Employed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 47.35% of the Employed when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"Employment in Agriculture and Fishing is predominantly male with 69.16% male share, while sectors like Education and Wholesale and Retail have a higher female employment share exceeding 50%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 5794 when Sex is Female.\",\n        \"The Employed of Sex Male is 3727 when Sex is Male.\",\n        \"The Economic sector Social Work and Health  accounts for 60.85% of the Employed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 39.15% of the Employed when Economic sector is Social Work and Health .\"\n      ],\n      \"insight\": \"The Social Work and Health sector employs significantly more females than males, with females representing about 61% of employment in this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 5839 when Sex is Female.\",\n        \"The Employed of Sex Male is 11487 when Sex is Male.\",\n        \"The Economic sector Support Service accounts for 33.70% of the Employed when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 66.30% of the Employed when Economic sector is Support Service.\"\n      ],\n      \"insight\": \"Support Service employment is male-dominated, with males accounting for approximately 66% of employed persons in the sector compared to 34% females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 7429 when Sex is Female.\",\n        \"The Employed of Sex Male is 6339 when Sex is Male.\",\n        \"The Economic sector Accommodation and Food accounts for 53.96% of the Employed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 46.04% of the Employed when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"The Accommodation and Food sector has a slightly higher female employment share at about 54%, indicating moderate female dominance in this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 19 when Sex is Female.\",\n        \"The Employed of Sex Male is 2302 when Sex is Male.\",\n        \"The Economic sector Electricity and Gas accounts for 0.82% of the Employed when Economic sector is Electricity and Gas.\",\n        \"The Economic sector Electricity and Gas accounts for 99.18% of the Employed when Economic sector is Electricity and Gas.\"\n      ],\n      \"insight\": \"The Electricity and Gas sector is overwhelmingly male-dominated with males constituting over 99% of employment, while female employment is nearly negligible.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 2981 when Sex is Female.\",\n        \"The Employed of Sex Male is 2810 when Sex is Male.\",\n        \"The Economic sector Financial and Insurance accounts for 51.48% of the Employed when Economic sector is Financial and Insurance.\",\n        \"The Economic sector Financial and Insurance accounts for 48.52% of the Employed when Economic sector is Financial and Insurance.\"\n      ],\n      \"insight\": [\n        \"The Financial and Insurance sector employs slightly more females (2981) than males (2810), showing a near parity in employment by sex in this sector.\",\n        \"Because females represent 51.48% and males 48.52% of employment in the Financial and Insurance sector, women hold a slight majority share in this economic sector.\",\n        \"When comparing employment numbers by sex, females outnumber males by 171 employed within the Financial and Insurance sector.\",\n        \"We observe that the employment gender distribution in the Financial and Insurance sector is nearly balanced, which might suggest gender inclusivity or similar opportunities within this sector.\",\n        \"The chart title emphasizes employment by sex in key sectors, and the data confirms that sex-based employment difference in Financial and Insurance is marginal but favors females.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Employed of Economic sector Agriculture and Fishing is 14021 when Economic sector is Agriculture and Fishing.\",\n        \"The Employed of Economic sector Agriculture and Fishing is 30646 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 31.39% of the Employed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 68.61% of the Employed when Economic sector is Agriculture and Fishing.\"\n      ],\n      \"insight\": \"Agriculture and Fishing is the largest employment sector in the Solomon Islands, making up between 31% and 69% of employment in that sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 14021 when Sex is Female.\",\n        \"The Employed of Sex Male is 30646 when Sex is Male.\",\n        \"The Sex Male accounts for 48.14% of the Employed when Sex is Male.\",\n        \"The Sex Female accounts for 44.70% of the Employed when Sex is Female.\"\n      ],\n      \"insight\": \"Male employment numbers are consistently higher than female employment in the Solomon Islands, with males accounting for around 48% and females about 45% of employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Economic sector Wholesale and Retail is 7350 when Economic sector is Wholesale and Retail.\",\n        \"The Employed of Economic sector Wholesale and Retail is 10454 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 41.28% of the Employed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 58.72% of the Employed when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"Wholesale and Retail is a significant employment sector in the Solomon Islands, comprising approximately 41% to 59% of employment within that sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Economic sector Construction is 97 when Economic sector is Construction.\",\n        \"The Employed of Economic sector Construction is 4340 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 2.19% of the Employed when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 97.81% of the Employed when Economic sector is Construction.\"\n      ],\n      \"insight\": \"Employment in the Construction sector varies widely but can represent a very small share (~2%) or a very large share (~98%) of employment within that sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Economic sector Accommodation and Food is 1055 when Economic sector is Accommodation and Food.\",\n        \"The Employed of Economic sector Accommodation and Food is 328 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 23.72% of the Employed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 76.28% of the Employed when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"The Accommodation and Food sector shows substantial variability in its share of employment, ranging from about 24% to 76% within the sector.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Employed of Economic sector Agriculture and Fishing is 11962 when Economic sector is Agriculture and Fishing.\",\n        \"The Employed of Economic sector Agriculture and Fishing is 19655 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 37.83% of the Employed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 62.17% of the Employed when Economic sector is Agriculture and Fishing.\",\n        \"The Employed of Sex Female is 11962 when Sex is Female.\",\n        \"The Employed of Sex Male is 19655 when Sex is Male.\"\n      ],\n      \"insight\": \"Agriculture and Fishing is the dominant employment sector in Vanuatu, accounting for a majority share of total employment, with males employed notably more than females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 2657 when Sex is Female.\",\n        \"The Employed of Sex Male is 2850 when Sex is Male.\",\n        \"The Economic sector Accommodation and Food accounts for 48.25% of the Employed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 51.75% of the Employed when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"Employment in the Accommodation and Food sector in Vanuatu is almost evenly split between females and males, each accounting for about half of the employed population in that sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 3071 when Sex is Female.\",\n        \"The Employed of Sex Male is 1722 when Sex is Male.\",\n        \"The Economic sector Education accounts for 64.07% of the Employed when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 35.93% of the Employed when Economic sector is Education.\"\n      ],\n      \"insight\": \"Education sector employment in Vanuatu is female-dominated, with females making up nearly two-thirds of total employment in the sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 7898 when Sex is Female.\",\n        \"The Employed of Sex Male is 3281 when Sex is Male.\",\n        \"The Economic sector Wholesale and Retail accounts for 70.65% of the Employed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 29.35% of the Employed when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"The Wholesale and Retail sector in Vanuatu employs significantly more females than males, with females constituting over two-thirds of employment in this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 1662 when Sex is Female.\",\n        \"The Employed of Sex Male is 1687 when Sex is Male.\",\n        \"The Economic sector Support Service accounts for 49.63% of the Employed when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 50.37% of the Employed when Economic sector is Support Service.\"\n      ],\n      \"insight\": \"Support Service employment in Vanuatu is nearly evenly divided between females and males, each representing about half of the workforce in this sector.\"\n    }\n  ]\n}"
  ]
}