{
  "timestamp": "2025-11-12T15:45:51.068754Z",
  "chart_title_list": [
    "Employment Distribution by Pacific Island Countries",
    "Male Employment in Agriculture by Country",
    "Employment Numbers by Sex and Economic Sector",
    "Employment by Sex Across Economic Sectors",
    "Employment by Sex in Leading Sectors of Solomon Islands & Micronesia",
    "Sex-based Employment in Key Sectors: Solomon Islands vs Palau & Niue"
  ],
  "chart_pattern": [
    "The chart reveals a dramatic disparity in employment numbers among Pacific Island countries, with the Solomon Islands and Vanuatu having significantly higher employment figures than the others. This sharp drop after these two suggests that population size or economic activity may be unevenly distributed across the region. The steep decline could also imply that smaller island nations face challenges in creating enough job opportunities, which might impact regional development and migration patterns. Understanding these variations is crucial for targeted economic policies and support programs.",
    "The most notable pattern in this chart is the dominant share of the Solomon Islands in male employment within the Agriculture and Fishing sector, accounting for nearly half of the total. This stark concentration suggests that the sector plays a more critical economic role in the Solomon Islands compared to its Pacific neighbors. In contrast, countries like Tonga and Kiribati contribute much smaller proportions, which might indicate differences in economic structure, resource availability, or labor market dynamics. The significant variation could reflect how cultural, geographic, and developmental factors shape employment patterns across these island nations.",
    "The chart reveals a striking gender disparity in certain sectors, notably Agriculture and Fishing, where male employment vastly outnumbers female. Conversely, females dominate sectors like Wholesale and Retail as well as Education, suggesting these industries may be more attractive or accessible to women. The minimal female presence in Construction and Transportation highlights potential barriers or industry preferences that limit women's participation. This pattern underscores enduring gender roles or structural workforce challenges that influence sectoral employment distributions by sex. Understanding these divides can inform policies aimed at encouraging more balanced representation across all sectors.",
    "A striking pattern in the chart is the overwhelming dominance of female employment in the Agriculture and Fishing sector, far exceeding male employment. Conversely, males significantly outnumber females in sectors like Construction and Education, suggesting strong gender-based occupational segmentation. This disparity might reflect traditional gender roles or access barriers in certain industries, highlighting potential areas for policy intervention to promote gender balance. The relatively balanced numbers in sectors such as Social Work and Insurance imply some fields may offer more equal employment opportunities.",
    "The chart reveals a striking gender disparity in employment distribution across sectors in Solomon Islands and Micronesia, with males overwhelmingly dominating sectors such as agriculture and construction. Conversely, females have a notably stronger presence in services within Micronesia, suggesting potential cultural or economic influences shaping occupational roles. This gendered pattern might reflect traditional societal norms or access to education and training, impacting workforce participation. The pronounced male dominance in physically intensive sectors could indicate enduring labor division by gender, which may have implications for policy aimed at promoting gender equality and economic diversification.",
    "The most striking pattern is the vast difference in employment scale across the three countries, with Solomon Islands showing a dramatically higher number of employed persons in both sectors, especially Wholesale and Retail, compared to Niue and Palau. Additionally, Solomon Islands exhibits a more balanced gender distribution in Wholesale and Retail, with females constituting a significant portion, while in Construction, males overwhelmingly dominate employment across all three countries. This disparity might reflect differences in population size, economic development, or industry focus, suggesting Solomon Islands has a larger, more diversified economy with greater female workforce participation in retail sectors. The gender imbalance in Construction could indicate traditional gender roles influencing sectoral employment."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The EmployedSum of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\",\n        \"The EmployedSum of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The EmployedSum of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The EmployedSum of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\"\n      ],\n      \"insight\": \"The Solomon Islands has the largest employed population among the Pacific Island Countries, followed by Vanuatu and Samoa, indicating these countries lead in employment size.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\",\n        \"The EmployedSum of Pacific Island Countries Niue is 512 when Pacific Island Countries is Niue.\",\n        \"The EmployedSum of Pacific Island Countries Tokelau is 172 when Pacific Island Countries is Tokelau.\",\n        \"The EmployedSum of Pacific Island Countries Tuvalu is 1501 when Pacific Island Countries is Tuvalu.\"\n      ],\n      \"insight\": \"Smaller Pacific Island Countries such as Niue, Tokelau, and Tuvalu have relatively low employment totals compared to larger islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Pacific Island Countries Marshall Islands is 10330 when Pacific Island Countries is Marshall Islands.\",\n        \"The EmployedSum of Pacific Island Countries Palau is 6398 when Pacific Island Countries is Palau.\",\n        \"The EmployedSum of Pacific Island Countries Micronesia (Federated States of) is 11242 when Pacific Island Countries is Micronesia (Federated States of).\"\n      ],\n      \"insight\": \"Micronesia, Marshall Islands, and Palau exhibit moderate employment figures, reflecting mid-sized labor pools among Pacific Island Countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Pacific Island Countries Nauru is 2314 when Pacific Island Countries is Nauru.\",\n        \"The EmployedSum of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\",\n        \"The EmployedSum of Pacific Island Countries Niue is 512 when Pacific Island Countries is Niue.\"\n      ],\n      \"insight\": \"Employment sizes in the Pacific Island Countries vary widely even among smaller islands, such as Nauru having more than four times the employed population of Niue.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The EmployedSum of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The EmployedSum of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\"\n      ],\n      \"insight\": \"Kiribati, Samoa, and Tonga share similar employment totals, suggesting comparable economic activity levels among these Pacific Island nations.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The PercentShare of CountryForPie Kiribati is 0.0611360093530787 when CountryForPie is Kiribati.\",\n        \"The PercentShare of CountryForPie Others is 0.0745323460639127 when CountryForPie is Others.\",\n        \"The PercentShare of CountryForPie Solomon Islands is 0.4976292543517797 when CountryForPie is Solomon Islands.\",\n        \"The PercentShare of CountryForPie Tonga is 0.0475448168355417 when CountryForPie is Tonga.\",\n        \"The PercentShare of CountryForPie Vanuatu is 0.3191575733956872 when CountryForPie is Vanuatu.\"\n      ],\n      \"insight\": [\n        \"The Solomon Islands account for nearly half of male employment in agriculture among the Pacific Island Countries, reflecting their dominant share at 49.76%.\",\n        \"Vanuatu holds the second-largest share of male employment in agriculture at approximately 31.92%, showing substantial workforce involvement in this sector.\",\n        \"Other Pacific Island Countries collectively make up about 7.45% of male employment in agriculture, indicating a smaller but diverse agricultural workforce group.\",\n        \"Kiribati and Tonga represent smaller shares of male agricultural employment at roughly 6.11% and 4.75% respectively, signaling more limited agricultural engagement compared to larger island nations.\",\n        \"When comparing these countries, male employment in agriculture is heavily concentrated in Solomon Islands and Vanuatu, suggesting regional economic dependency on agriculture varies significantly within the Pacific Islands.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Sex Female is 7429 when Sex is Female.\",\n        \"The EmployedSum of Sex Male is 6339 when Sex is Male.\",\n        \"The Sex Male accounts for 39.37% of the EmployedSum when Sex is Male.\",\n        \"The Sex Female accounts for 28.55% of the EmployedSum when Sex is Female.\",\n        \"The Sex Female accounts for 27.95% of the EmployedSum when Sex is Female.\"\n      ],\n      \"insight\": \"Females and males both have substantial employment numbers, with males accounting for a larger percentage (39.37%) of the total employed compared to females (around 28-29%) in the dataset.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Economic sector Agriculture and Fishing is 27460 when Economic sector is Agriculture and Fishing.\",\n        \"The EmployedSum of Economic sector Agriculture and Fishing is 61584 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 30.84% of the EmployedSum when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 69.16% of the EmployedSum when Economic sector is Agriculture and Fishing.\"\n      ],\n      \"insight\": \"The Agriculture and Fishing sector shows a significant gender employment disparity, with males accounting for approximately 69% of the employed while females account for about 31%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Economic sector Accommodation and Food is 7429 when Economic sector is Accommodation and Food.\",\n        \"The EmployedSum of Economic sector Accommodation and Food is 6339 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 46.04% of the EmployedSum when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 53.96% of the EmployedSum when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"In the Accommodation and Food sector, females slightly outnumber males, comprising approximately 54% of the employed compared to males at around 46%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Economic sector Construction is 256 when Economic sector is Construction.\",\n        \"The EmployedSum of Economic sector Construction is 15931 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 1.58% of the EmployedSum when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 98.42% of the EmployedSum when Economic sector is Construction.\"\n      ],\n      \"insight\": \"The Construction sector is predominantly male, with males representing over 98% of employed persons in this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Economic sector Social Work and Health  is 5794 when Economic sector is Social Work and Health .\",\n        \"The EmployedSum of Economic sector Social Work and Health  is 3727 when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 60.85% of the EmployedSum when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 39.15% of the EmployedSum when Economic sector is Social Work and Health .\"\n      ],\n      \"insight\": \"The Social Work and Health sector is strongly female-dominated, with females making up about 61% of employment compared to 39% males.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Sex Female is 27460 when Sex is Female.\",\n        \"The EmployedSum of Sex Male is 61584 when Sex is Male.\",\n        \"The Sex Female accounts for 28.55% of the EmployedSum when Sex is Female.\",\n        \"The Sex Male accounts for 39.37% of the EmployedSum when Sex is Male.\",\n        \"The EmployedSum of Sex Female is 3.05 times more than that of Female when Sex is Female.\",\n        \"The EmployedSum of Sex Male is 10.50 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Male employment greatly surpasses female employment across sectors, with males accounting for a higher percentage of total employment and showing much larger multiples of employed sums compared to females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Economic sector Construction is 15931 when Economic sector is Construction.\",\n        \"The EmployedSum of Economic sector Construction is 256 when Economic sector is Construction.\",\n        \"The EmployedSum of Economic sector Construction is 62.23 times more than that of Construction when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 1.58% of the EmployedSum when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 98.42% of the EmployedSum when Economic sector is Construction.\"\n      ],\n      \"insight\": \"Construction sector employment is disproportionately dominated by one group representing over 98% of employed sums, indicating a significant gender disparity within this sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Economic sector Electricity and Gas is 2302 when Economic sector is Electricity and Gas.\",\n        \"The EmployedSum of Economic sector Electricity and Gas is 19 when Economic sector is Electricity and Gas.\",\n        \"The EmployedSum of Economic sector Electricity and Gas is 121.16 times more than that of Electricity and Gas when Economic sector is Electricity and Gas.\",\n        \"The Economic sector Electricity and Gas accounts for 0.82% of the EmployedSum when Economic sector is Electricity and Gas.\",\n        \"The Economic sector Electricity and Gas accounts for 99.18% of the EmployedSum when Economic sector is Electricity and Gas.\"\n      ],\n      \"insight\": \"Electricity and Gas sector employment is highly concentrated in one sex, representing over 99% of the employed sum, showing a marked gender imbalance.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Social Work and Health  accounts for 60.85% of the EmployedSum when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 39.15% of the EmployedSum when Economic sector is Social Work and Health .\",\n        \"The EmployedSum of Economic sector Social Work and Health  is 5794 when Economic sector is Social Work and Health .\",\n        \"The EmployedSum of Economic sector Social Work and Health  is 3727 when Economic sector is Social Work and Health .\",\n        \"The EmployedSum of Economic sector Social Work and Health  is 1.55 times more than that of Social Work and Health  when Economic sector is Social Work and Health .\"\n      ],\n      \"insight\": \"Social Work and Health sector shows a notable majority employment by one sex with over 60% of employed sums, indicating clear gender dominance.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Economic sector Accommodation and Food is 7429 when Economic sector is Accommodation and Food.\",\n        \"The EmployedSum of Economic sector Accommodation and Food is 6339 when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 53.96% of the EmployedSum when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 46.04% of the EmployedSum when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"Accommodation and Food sector employment is relatively balanced between sexes, each accounting for approximately half of the employed sum within the sector.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Economic sector Agriculture and Fishing is 14021 when Economic sector is Agriculture and Fishing.\",\n        \"The EmployedSum of Economic sector Agriculture and Fishing is 30646 when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 67.37% of the EmployedSum when Economic sector is Agriculture and Fishing.\",\n        \"The EmployedSum of Economic sector Wholesale and Retail is 7350 when Economic sector is Wholesale and Retail.\",\n        \"The EmployedSum of Economic sector Wholesale and Retail is 10454 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 49.58% of the EmployedSum when Economic sector is Wholesale and Retail.\",\n        \"The EmployedSum of Economic sector Education is 5982 when Economic sector is Education.\",\n        \"The EmployedSum of Economic sector Education is 7385 when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 45.90% of the EmployedSum when Economic sector is Education.\",\n        \"The EmployedSum of Economic sector Support Service is 1129 when Economic sector is Support Service.\",\n        \"The EmployedSum of Economic sector Support Service is 4289 when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 75.72% of the EmployedSum when Economic sector is Support Service.\",\n        \"The EmployedSum of Sex Female is 14021 when Sex is Female.\",\n        \"The EmployedSum of Sex Male is 30646 when Sex is Male.\",\n        \"The EmployedSum of Sex Female is 7350 when Sex is Female.\",\n        \"The EmployedSum of Sex Male is 10454 when Sex is Male.\"\n      ],\n      \"insight\": \"In the Solomon Islands & Micronesia, Agriculture and Fishing is the leading employment sector with the highest EmployedSum, notably constituting over 67% of employment in that sector, while Wholesale and Retail and Education follow with significant but lower EmployedSum proportions.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Sex Male is 30646 when Sex is Male.\",\n        \"The EmployedSum of Sex Female is 14021 when Sex is Female.\",\n        \"The EmployedSum of Sex Male is 10454 when Sex is Male.\",\n        \"The EmployedSum of Sex Female is 7350 when Sex is Female.\",\n        \"The Sex Male accounts for 54.04% of the EmployedSum when Sex is Male.\",\n        \"The Sex Female accounts for 23.25% of the EmployedSum when Sex is Female.\"\n      ],\n      \"insight\": \"Male workers have substantially higher EmployedSum than female workers across leading economic sectors in Solomon Islands & Micronesia, with males representing the majority share of total employment.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Agriculture and Fishing accounts for 67.37% of the EmployedSum when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Support Service accounts for 75.72% of the EmployedSum when Economic sector is Support Service.\",\n        \"The Economic sector Wholesale and Retail accounts for 49.58% of the EmployedSum when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Education accounts for 45.90% of the EmployedSum when Economic sector is Education.\"\n      ],\n      \"insight\": \"Support Service shows the highest concentration of employment within its sector in Solomon Islands & Micronesia, followed by Agriculture and Fishing, indicating these sectors dominate employment distribution.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Economic sector Support Service is 1129 when Economic sector is Support Service.\",\n        \"The EmployedSum of Economic sector Support Service is 4289 when Economic sector is Support Service.\",\n        \"The EmployedSum of Sex Male is 4289 when Sex is Male.\",\n        \"The EmployedSum of Sex Female is 1129 when Sex is Female.\"\n      ],\n      \"insight\": \"Employment in the Support Service sector is heavily male-dominated in the Solomon Islands & Micronesia, with male employees accounting for nearly four times the EmployedSum of females.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Wholesale and Retail accounts for 49.58% of the EmployedSum when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Education accounts for 45.90% of the EmployedSum when Economic sector is Education.\",\n        \"The Sex Female accounts for 23.25% of the EmployedSum when Sex is Female.\",\n        \"The Sex Male accounts for 54.04% of the EmployedSum when Sex is Male.\"\n      ],\n      \"insight\": \"Wholesale and Retail and Education sectors contribute sizable proportions of employment, but females form a much smaller share of total employment compared to males, highlighting persistent gender disparities in these sectors.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of CountryGroup Solomon Islands is 10454 when CountryGroup is Solomon Islands.\",\n        \"The CountryGroup Solomon Islands accounts for 47.00% of the EmployedSum when CountryGroup is Solomon Islands.\",\n        \"The EmployedSum of CountryGroup Palau is 743 when CountryGroup is Palau.\",\n        \"The CountryGroup Palau accounts for 39.29% of the EmployedSum when CountryGroup is Palau.\",\n        \"The EmployedSum of CountryGroup Niue is 53 when CountryGroup is Niue.\",\n        \"The CountryGroup Niue accounts for 41.73% of the EmployedSum when CountryGroup is Niue.\"\n      ],\n      \"insight\": \"Among the Pacific Island Countries, the Solomon Islands have the highest total employment sum, accounting for nearly half of the EmployedSum, followed by Palau and Niue with significantly smaller but still substantial shares.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Sex Female is 7350 when Sex is Female.\",\n        \"The EmployedSum of Sex Male is 10454 when Sex is Male.\",\n        \"The Sex Male accounts for 64.30% of the EmployedSum when Sex is Male.\",\n        \"The Sex Female accounts for 6.24% of the EmployedSum when Sex is Female.\",\n        \"The EmployedSum of Sex Female is 282.69 times more than that of Female when Sex is Female.\",\n        \"The EmployedSum of Sex Male is 232.31 times more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Male employment totals are higher than female employment in the dataset, with males accounting for a larger proportion of total employed persons across the recorded Pacific Island Countries.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Economic sector Wholesale and Retail is 10454 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 38.68% of the EmployedSum when Economic sector is Wholesale and Retail.\",\n        \"The EmployedSum of Economic sector Construction is 4340 when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 14.13% of the EmployedSum when Economic sector is Construction.\"\n      ],\n      \"insight\": \"The Wholesale and Retail economic sector dominates employment among the sectors in these Pacific Island Countries, representing a significantly larger share of employment compared to the Construction sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The CountryGroup Solomon Islands accounts for 19.51% of the EmployedSum when CountryGroup is Solomon Islands.\",\n        \"The CountryGroup Palau accounts for 32.95% of the EmployedSum when CountryGroup is Palau.\",\n        \"The CountryGroup Niue accounts for 22.83% of the EmployedSum when CountryGroup is Niue.\"\n      ],\n      \"insight\": \"When comparing the proportion of employed within each country group, Palau holds a higher employment proportion than Niue and Solomon Islands.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The EmployedSum of Sex Male is 4340 when Sex is Male.\",\n        \"The EmployedSum of Sex Female is 7350 when Sex is Female.\",\n        \"The EmployedSum of Economic sector Wholesale and Retail is 10454 when Economic sector is Wholesale and Retail.\",\n        \"The EmployedSum of CountryGroup Solomon Islands is 10454 when CountryGroup is Solomon Islands.\"\n      ],\n      \"insight\": \"Employment in the Solomon Islands is closely associated with high participation in the Wholesale and Retail sector and reflects substantial contributions from both male and female workers.\"\n    }\n  ]\n}"
  ]
}