{
  "timestamp": "2025-11-13T09:21:21.736774Z",
  "chart_title_list": [
    "Employment Numbers Across Pacific Island Countries",
    "Employment by Sex Across Pacific Island Countries",
    "Employment Numbers by Sex Across Countries",
    "Employment by Sex Across Economic Sectors",
    "Employment by Sex and Sector in Marshall Islands",
    "Employment Distribution by Sex and Sector in Nauru"
  ],
  "chart_pattern": [
    "The chart reveals that Solomon Islands and Vanuatu have significantly higher employment numbers compared to other Pacific Island countries, with Solomon Islands leading by a large margin. This stark contrast likely reflects differences in population size and economic activities, where these two countries might have larger labor markets or more developed industries. Interestingly, smaller island nations like Tokelau and Niue show very low employment figures, which could be due to their smaller populations or limited economic opportunities. This uneven distribution highlights the varied economic scales and development levels across the Pacific region, which could impact regional planning and resource allocation.",
    "The chart reveals a consistent pattern where male employment numbers exceed female employment across most Pacific Island countries, with Solomon Islands showing the largest gap by a wide margin. Interestingly, countries like Cook Islands and Vanuatu show a relatively smaller gender disparity, suggesting more balanced employment between sexes. This disparity might reflect traditional gender roles, economic sectors dominated by men, or differences in workforce participation rates. The substantial male dominance in employment could have implications for gender-focused policies and economic planning in the region.",
    "The most striking pattern in this chart is the significant gap in employment numbers between males and females in the Solomon Islands, where male employment is more than double that of females. In contrast, Vanuatu shows a much smaller disparity, with male employment only moderately higher than female employment. This contrast might reflect differing cultural, economic, or policy factors influencing labor market participation by gender in these countries. The large male dominance in Solomon Islands could suggest traditional gender roles are more pronounced or opportunities for women in the workforce are more limited. Understanding these differences could be important for targeted employment policies promoting gender equality in the region.",
    "The most striking pattern in the chart is the significant gender disparity in the Agriculture and Fishing sector, where male employment vastly exceeds female employment, suggesting traditional gender roles may strongly influence work in this industry. Conversely, sectors like Education and Wholesale and Retail show a reverse trend, with females outnumbering males, hinting at societal norms or opportunities that favor women in these fields. The nearly equal numbers in Social Work and Insurance suggest these sectors might be more gender-neutral or equally accessible. This variation across sectors emphasizes how economic roles in Pacific Island countries can be heavily gendered, potentially impacting income distribution and social dynamics.",
    "The most striking pattern in this chart is the stark gender disparity in sectors like Construction and Wholesale and Retail, where male employment far exceeds female employment. Conversely, sectors such as Social Work and Health show a higher number of female employees, reflecting traditional gender roles and possibly cultural influences in the Marshall Islands. The relatively balanced employment in Education contrasts with these extremes, suggesting it is a more gender-integrated field. These differences may highlight how societal norms and job accessibility shape workforce composition across sectors. Understanding these patterns could be important for policies aiming to promote gender equality in employment.",
    "The most striking pattern in the employment distribution is the gender disparity in the Construction and Transportation and Storage sectors, where males vastly outnumber females. Conversely, sectors like Education and Support Service have a notably higher female workforce, suggesting gender-based preferences or societal roles influencing career choices in Nauru. This uneven gender representation could reflect traditional labor divisions or access to opportunities, highlighting potential areas for policy focus on gender equality in the workforce."
  ],
  "insight_from_fact": [
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 4316 when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 18767 when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 10330 when Pacific Island Countries is Marshall Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Micronesia (Federated States of) is 11242 when Pacific Island Countries is Micronesia (Federated States of).\",\n        \"The TotalEmployed of Pacific Island Countries Nauru is 2314 when Pacific Island Countries is Nauru.\",\n        \"The TotalEmployed of Pacific Island Countries Niue is 512 when Pacific Island Countries is Niue.\",\n        \"The TotalEmployed of Pacific Island Countries Palau is 6398 when Pacific Island Countries is Palau.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 19309 when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 95024 when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 172 when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tonga is 16920 when Pacific Island Countries is Tonga.\",\n        \"The TotalEmployed of Pacific Island Countries Tuvalu is 1501 when Pacific Island Countries is Tuvalu.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 65779 when Pacific Island Countries is Vanuatu.\"\n      ],\n      \"insight\": [\n        \"The Solomon Islands has the highest total employment among Pacific Island Countries, with 95,024 employed individuals, indicating its larger workforce relative to others.\",\n        \"Vanuatu and Samoa follow as significant employment hubs with total employed counts of 65,779 and 19,309 respectively, showing regional employment concentration.\",\n        \"Small island nations like Niue and Tokelau have the lowest total employed numbers at 512 and 172 respectively, reflecting their smaller population or labor markets.\",\n        \"Mid-sized Pacific Island Countries such as Kiribati, Tonga, and Micronesia (Federated States of) show moderate employment levels ranging from approximately 11,000 to 19,000.\",\n        \"There is considerable variation in total employment across Pacific Island Countries, demonstrating heterogeneous economic scales and labor capacities within this regional group.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Solomon Islands is 2.03 times more than that of Solomon Islands when Pacific Island Countries is Solomon Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Samoa is 1.65 times more than that of Samoa when Pacific Island Countries is Samoa.\",\n        \"The TotalEmployed of Pacific Island Countries Vanuatu is 7811 more than that of Vanuatu when Pacific Island Countries is Vanuatu.\",\n        \"The TotalEmployed of Pacific Island Countries Kiribati is 3437 more than that of Kiribati when Pacific Island Countries is Kiribati.\",\n        \"The TotalEmployed of Pacific Island Countries Marshall Islands is 2.27 times more than that of Marshall Islands when Pacific Island Countries is Marshall Islands.\"\n      ],\n      \"insight\": \"The TotalEmployed numbers tend to be significantly higher for Solomon Islands, Marshall Islands, Samoa, Vanuatu, and Kiribati when aggregated by Pacific Island Countries, showing high overall employment in these nations.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Solomon Islands accounts for 33.01% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 66.99% of the TotalEmployed when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Samoa accounts for 37.73% of the TotalEmployed when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Samoa accounts for 62.27% of the TotalEmployed when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Vanuatu accounts for 44.06% of the TotalEmployed when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 55.94% of the TotalEmployed when Pacific Island Countries is Vanuatu.\"\n      ],\n      \"insight\": \"In several Pacific Island Countries like Solomon Islands, Samoa, and Vanuatu, the workforce distribution shows nearly balanced shares with some countries having around 33–44% of TotalEmployed in one segment and 56–67% in the other.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Sex Female is 2047 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 2269 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 7285 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 12024 when Sex is Male.\",\n        \"The TotalEmployed of Sex Female is 31369 when Sex is Female.\",\n        \"The TotalEmployed of Sex Male is 63655 when Sex is Male.\"\n      ],\n      \"insight\": \"Total employment for Sex Male consistently exceeds that of Sex Female across Pacific Island Countries, reflecting a gender employment gap in the region.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Pacific Island Countries Tokelau accounts for 51.74% of the TotalEmployed when Pacific Island Countries is Tokelau.\",\n        \"The Pacific Island Countries Tokelau accounts for 48.26% of the TotalEmployed when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 6 more than that of Tokelau when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 89 when Pacific Island Countries is Tokelau.\",\n        \"The TotalEmployed of Pacific Island Countries Tokelau is 83 when Pacific Island Countries is Tokelau.\"\n      ],\n      \"insight\": \"Tokelau shows nearly equal employment distribution (around 48–52%) between key groups within its TotalEmployed, but the absolute employment numbers remain very small compared to other Pacific Island nations.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The TotalEmployed of Pacific Island Countries Cook Islands is 222 more than that of Cook Islands when Pacific Island Countries is Cook Islands.\",\n        \"The Pacific Island Countries Cook Islands accounts for 47.43% of the TotalEmployed when Pacific Island Countries is Cook Islands.\",\n        \"The Pacific Island Countries Cook Islands accounts for 52.57% of the TotalEmployed when Pacific Island Countries is Cook Islands.\",\n        \"The TotalEmployed of Pacific Island Countries Niue is 16 more than that of Niue when Pacific Island Countries is Niue.\",\n        \"The Pacific Island Countries Niue accounts for 48.44% of the TotalEmployed when Pacific Island Countries is Niue.\",\n        \"The Pacific Island Countries Niue accounts for 51.56% of the TotalEmployed when Pacific Island Countries is Niue.\"\n      ],\n      \"insight\": \"Both Cook Islands and Niue feature almost balanced employment shares close to 50% between groups in TotalEmployed, but their total employment numbers are relatively small in comparison with other Pacific Island Countries.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Rank of Sex Male is 1.0 when Sex is Male.\",\n        \"The Rank of Sex Female is 1.0 when Sex is Female.\",\n        \"The Sex Female accounts for 7.69% of the Rank when Sex is Female.\",\n        \"The Sex Male accounts for 7.69% of the Rank when Sex is Male.\",\n        \"The Rank of Pacific Island Countries Solomon Islands is 1.0 when Pacific Island Countries is Solomon Islands.\",\n        \"The Pacific Island Countries Solomon Islands accounts for 50.00% of the Rank when Pacific Island Countries is Solomon Islands.\",\n        \"The Rank of Pacific Island Countries Vanuatu is 1.0 when Pacific Island Countries is Vanuatu.\",\n        \"The Pacific Island Countries Vanuatu accounts for 50.00% of the Rank when Pacific Island Countries is Vanuatu.\",\n        \"The Rank of Pacific Island Countries Samoa is 1.0 when Pacific Island Countries is Samoa.\",\n        \"The Pacific Island Countries Samoa accounts for 50.00% of the Rank when Pacific Island Countries is Samoa.\"\n      ],\n      \"insight\": [\n        \"Employment ranks for males and females are equal at 1.0 within their respective groups, indicating parity in rank position across sexes.\",\n        \"Both males and females each account for 7.69% of the overall Rank, showing equal proportional representation in employment numbers by sex.\",\n        \"Across Pacific Island countries, every country, including Solomon Islands, Vanuatu, and Samoa, holds the top Rank of 1.0 within their group, signifying equal highest employment ranking within each country.\",\n        \"Each named Pacific Island country consistently accounts for 50.00% of the Rank within its group, indicating a balanced split in employment distribution by sex within those countries.\",\n        \"Because each Pacific Island country and sex grouping holds uniform Rank and accounts for an equal share, employment distribution by sex appears highly balanced both between and within these countries.\"\n      ]\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 26883 when Sex is Female.\",\n        \"The Employed of Sex Male is 24172 when Sex is Male.\",\n        \"The Employed of Sex Female is 27460 when Sex is Female.\",\n        \"The Employed of Sex Male is 61584 when Sex is Male.\",\n        \"The Employed of Sex Female is 17671 when Sex is Female.\",\n        \"The Employed of Sex Male is 14541 when Sex is Male.\",\n        \"The Employed of Sex Female is 5839 when Sex is Female.\",\n        \"The Employed of Sex Male is 11487 when Sex is Male.\",\n        \"The Employed of Sex Female is 1090 more than that of Female when Sex is Female.\",\n        \"The Employed of Sex Male is 4444 more than that of Male when Sex is Male.\"\n      ],\n      \"insight\": \"Employment numbers vary significantly by sex across economic sectors, with males dominating Agriculture and Fishing while females have higher employment in Wholesale and Retail.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Social Work and Health  accounts for 60.85% of the Employed when Economic sector is Social Work and Health .\",\n        \"The Sex Female accounts for 28.55% of the Employed when Sex is Female.\",\n        \"The Economic sector Social Work and Health  is 1.55 times more than that of Social Work and Health  when Economic sector is Social Work and Health .\",\n        \"The Employed of Sex Female is 5794 when Sex is Female.\",\n        \"The Employed of Sex Male is 3727 when Sex is Male.\"\n      ],\n      \"insight\": \"The Social Work and Health sector employs a higher proportion of females than males, representing over 60% of employment in that sector.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Construction is 62.23 times more than that of Construction when Economic sector is Construction.\",\n        \"The Employed of Economic sector Construction is 256 when Economic sector is Construction.\",\n        \"The Employed of Economic sector Construction is 15931 when Economic sector is Construction.\",\n        \"The Employed of Sex Female is 256 when Sex is Female.\",\n        \"The Employed of Sex Male is 15931 when Sex is Male.\",\n        \"The Economic sector Construction accounts for 1.58% of the Employed when Economic sector is Construction.\",\n        \"The Economic sector Construction accounts for 98.42% of the Employed when Economic sector is Construction.\"\n      ],\n      \"insight\": \"Construction is a male-dominated sector, with males comprising over 98% of the employed in this industry.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Electricity and Gas is 121.16 times more than that of Electricity and Gas when Economic sector is Electricity and Gas.\",\n        \"The Employed of Economic sector Electricity and Gas is 19 when Economic sector is Electricity and Gas.\",\n        \"The Employed of Economic sector Electricity and Gas is 2302 when Economic sector is Electricity and Gas.\",\n        \"The Employed of Sex Female is 19 when Sex is Female.\",\n        \"The Employed of Sex Male is 2302 when Sex is Male.\",\n        \"The Economic sector Electricity and Gas accounts for 0.82% of the Employed when Economic sector is Electricity and Gas.\",\n        \"The Economic sector Electricity and Gas accounts for 99.18% of the Employed when Economic sector is Electricity and Gas.\"\n      ],\n      \"insight\": \"The Electricity and Gas sector is heavily male-dominated, with males making up over 99% of the workforce.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Accommodation and Food accounts for 53.96% of the Employed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 46.04% of the Employed when Economic sector is Accommodation and Food.\",\n        \"The Employed of Sex Female is 7429 when Sex is Female.\",\n        \"The Employed of Sex Male is 6339 when Sex is Male.\",\n        \"The Employed of Economic sector Accommodation and Food is 1090 more than that of Accommodation and Food when Economic sector is Accommodation and Food.\"\n      ],\n      \"insight\": \"The Accommodation and Food sector shows a slightly higher employment of females compared to males, accounting for approximately 54% of employment in this sector.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Employed of Economic sector Accommodation and Food is 329 when Economic sector is Accommodation and Food.\",\n        \"The Employed of Economic sector Accommodation and Food is 373 when Economic sector is Accommodation and Food.\",\n        \"The Employed of Economic sector Education is 909 when Economic sector is Education.\",\n        \"The Employed of Economic sector Education is 1106 when Economic sector is Education.\",\n        \"The Employed of Economic sector Financial and Insurance is 190 when Economic sector is Financial and Insurance.\",\n        \"The Employed of Economic sector Financial and Insurance is 163 when Economic sector is Financial and Insurance.\",\n        \"The Employed of Economic sector Social Work and Health  is 441 when Economic sector is Social Work and Health .\",\n        \"The Employed of Economic sector Social Work and Health  is 394 when Economic sector is Social Work and Health .\",\n        \"The Employed of Economic sector Support Service is 383 when Economic sector is Support Service.\",\n        \"The Employed of Economic sector Support Service is 744 when Economic sector is Support Service.\",\n        \"The Employed of Economic sector Transportation and Storage is 134 when Economic sector is Transportation and Storage.\",\n        \"The Employed of Economic sector Transportation and Storage is 903 when Economic sector is Transportation and Storage.\",\n        \"The Employed of Economic sector Wholesale and Retail is 775 when Economic sector is Wholesale and Retail.\",\n        \"The Employed of Economic sector Wholesale and Retail is 961 when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"Employment numbers vary considerably across economic sectors in the Marshall Islands, with the highest employment observed in Transportation and Storage (up to 903) and the lowest in Financial and Insurance (as low as 163).\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Financial and Insurance accounts for 53.82% of the Employed when Economic sector is Financial and Insurance.\",\n        \"The Economic sector Financial and Insurance accounts for 46.18% of the Employed when Economic sector is Financial and Insurance.\",\n        \"The Economic sector Social Work and Health  accounts for 52.81% of the Employed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 47.19% of the Employed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Accommodation and Food accounts for 46.87% of the Employed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Accommodation and Food accounts for 53.13% of the Employed when Economic sector is Accommodation and Food.\",\n        \"The Economic sector Education accounts for 45.11% of the Employed when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 54.89% of the Employed when Economic sector is Education.\",\n        \"The Economic sector Wholesale and Retail accounts for 44.64% of the Employed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 55.36% of the Employed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Support Service accounts for 33.98% of the Employed when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 66.02% of the Employed when Economic sector is Support Service.\",\n        \"The Economic sector Transportation and Storage accounts for 12.92% of the Employed when Economic sector is Transportation and Storage.\",\n        \"The Economic sector Transportation and Storage accounts for 87.08% of the Employed when Economic sector is Transportation and Storage.\"\n      ],\n      \"insight\": \"Economic sector employment shares in the Marshall Islands display balanced distribution with sectors like Education, Social Work and Health, and Accommodation and Food showing near-even splits around 45-55%, while Transportation and Storage and Support Service exhibit more polarized employment percentages.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 909 when Sex is Female.\",\n        \"The Employed of Sex Male is 1106 when Sex is Male.\",\n        \"The Employed of Sex Female is 775 when Sex is Female.\",\n        \"The Employed of Sex Male is 961 when Sex is Male.\",\n        \"The Employed of Sex Female is 383 when Sex is Female.\",\n        \"The Employed of Sex Male is 744 when Sex is Male.\",\n        \"The Employed of Sex Female is 441 when Sex is Female.\",\n        \"The Employed of Sex Male is 394 when Sex is Male.\",\n        \"The Employed of Sex Female is 190 when Sex is Female.\",\n        \"The Employed of Sex Male is 163 when Sex is Male.\",\n        \"The Employed of Sex Female is 134 when Sex is Female.\",\n        \"The Employed of Sex Male is 903 when Sex is Male.\",\n        \"The Employed of Sex Female is 329 when Sex is Female.\",\n        \"The Employed of Sex Male is 373 when Sex is Male.\"\n      ],\n      \"insight\": \"For most economic sectors in the Marshall Islands, male employment numbers surpass female employment, with notable exceptions in sectors like Social Work and Health where female employment tends to be stronger.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 2.46 times more than that of Female when Sex is Female.\",\n        \"The Employed of Sex Male is 1.99 times more than that of Male when Sex is Male.\",\n        \"The Employed of Sex Male is 6.98 times more than that of Male when Sex is Male.\",\n        \"The Employed of Sex Female is 6.78 times more than that of Female when Sex is Female.\",\n        \"The Employed of Sex Female is 4.08 times more than that of Female when Sex is Female.\",\n        \"The Employed of Sex Male is 4.66 times more than that of Male when Sex is Male.\",\n        \"The Employed of Sex Male is 3.85 times more than that of Male when Sex is Male.\",\n        \"The Employed of Sex Female is 3.29 times more than that of Female when Sex is Female.\"\n      ],\n      \"insight\": \"Employment intensity multipliers suggest that both males and females in the Marshall Islands experience significantly higher employment factors in certain sectors, with several instances of females having greater relative employment levels than males.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Sex Female accounts for 28.76% of the Employed when Sex is Female.\",\n        \"The Sex Female accounts for 24.52% of the Employed when Sex is Female.\",\n        \"The Sex Female accounts for 13.95% of the Employed when Sex is Female.\",\n        \"The Sex Female accounts for 12.12% of the Employed when Sex is Female.\",\n        \"The Sex Female accounts for 10.41% of the Employed when Sex is Female.\",\n        \"The Sex Female accounts for 6.01% of the Employed when Sex is Female.\",\n        \"The Sex Male accounts for 15.86% of the Employed when Sex is Male.\",\n        \"The Sex Male accounts for 15.43% of the Employed when Sex is Male.\",\n        \"The Sex Male accounts for 13.40% of the Employed when Sex is Male.\",\n        \"The Sex Male accounts for 12.60% of the Employed when Sex is Male.\",\n        \"The Sex Male accounts for 10.60% of the Employed when Sex is Male.\",\n        \"The Sex Male accounts for 8.76% of the Employed when Sex is Male.\",\n        \"The Sex Male accounts for 5.50% of the Employed when Sex is Male.\"\n      ],\n      \"insight\": \"The distribution of employment shares by sex in the Marshall Islands shows a wider range for females, with some sectors having female shares as high as nearly 29%, while male shares are generally more concentrated between 5.5% and 16%.\"\n    }\n  ]\n}",
    "{\n  \"insight_list\": [\n    {\n      \"selected_facts\": [\n        \"The Employed of Economic sector Social Work and Health  is 207 when Economic sector is Social Work and Health .\",\n        \"The Employed of Economic sector Social Work and Health  is 162 when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 56.10% of the Employed when Economic sector is Social Work and Health .\",\n        \"The Economic sector Social Work and Health  accounts for 43.90% of the Employed when Economic sector is Social Work and Health .\",\n        \"The Employed of Economic sector Education is 226 when Economic sector is Education.\",\n        \"The Employed of Economic sector Education is 56 when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 80.14% of the Employed when Economic sector is Education.\",\n        \"The Economic sector Education accounts for 19.86% of the Employed when Economic sector is Education.\"\n      ],\n      \"insight\": \"Employment in Social Work and Health sector is a dominant part of its total employed population in Pacific Island Countries, with up to 56.10% share, while Employment in Education sector shows a wide variance with one portion accounting for as high as 80.14%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Economic sector Wholesale and Retail is 127 when Economic sector is Wholesale and Retail.\",\n        \"The Employed of Economic sector Wholesale and Retail is 161 when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 44.10% of the Employed when Economic sector is Wholesale and Retail.\",\n        \"The Economic sector Wholesale and Retail accounts for 55.90% of the Employed when Economic sector is Wholesale and Retail.\"\n      ],\n      \"insight\": \"Wholesale and Retail sector employment varies significantly among Pacific Island Countries, with employment counts from 127 to 161 and proportional employment shares ranging from about 44% to 56%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Economic sector Support Service is 185 when Economic sector is Support Service.\",\n        \"The Employed of Economic sector Support Service is 401 when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 31.57% of the Employed when Economic sector is Support Service.\",\n        \"The Economic sector Support Service accounts for 68.43% of the Employed when Economic sector is Support Service.\"\n      ],\n      \"insight\": \"Support Service sector employment shows marked disparities in Pacific Island Countries, with some having over twice the number of employed and employment proportions varying between 31.57% to 68.43%.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Employed of Sex Female is 226 when Sex is Female.\",\n        \"The Employed of Sex Male is 401 when Sex is Male.\",\n        \"The Employed of Sex Female is 185 when Sex is Female.\",\n        \"The Employed of Sex Male is 162 when Sex is Male.\",\n        \"The Employed of Sex Female is 127 when Sex is Female.\",\n        \"The Employed of Sex Male is 161 when Sex is Male.\"\n      ],\n      \"insight\": \"Across Pacific Island Countries, male employment numbers often exceed female employment, as seen in several sectors where male counts surpass females by significant margins.\"\n    },\n    {\n      \"selected_facts\": [\n        \"The Economic sector Agriculture and Fishing accounts for 26.51% of the Employed when Economic sector is Agriculture and Fishing.\",\n        \"The Economic sector Agriculture and Fishing accounts for 73.49% of the Employed when Economic sector is Agriculture and Fishing.\",\n        \"The Employed of Economic sector Agriculture and Fishing is 22 when Economic sector is Agriculture and Fishing.\",\n        \"The Employed of Economic sector Agriculture and Fishing is 61 when Economic sector is Agriculture and Fishing.\"\n      ],\n      \"insight\": \"Agriculture and Fishing sector employment in Pacific Island Countries exhibits large variability, with employment proportions ranging from about 26.5% to 73.5% and employee counts from 22 to 61.\"\n    }\n  ]\n}"
  ]
}